[
  {
    "id": 1,
    "name": "Princess Diana",
    "birth": "1961-07-01",
    "birth_place": "Sandringham, England",
    "death": "1997-08-31",
    "death_place": "Paris, France",
    "cause_of_death": "Accident",
    "profile_pic": "https://upload.wikimedia.org/wikipedia/commons/5/5e/Diana%2C_Princess_of_Wales_1997_%282%29.jpg",
    "bio": "Princess Diana, born Diana Frances Spencer, was a member of the British royal family and became an international icon through her marriage to Charles, Prince of Wales. Born into British nobility, she grew up close to the royal family on their Sandringham estate. Diana's fairy-tale wedding to Prince Charles in 1981 was broadcast worldwide, making her a global figure. She was known for her elegance, compassion, and deep commitment to charitable causes. Diana worked extensively with organizations combating landmines, AIDS, and homelessness, often visiting hospitals and impoverished areas to bring attention to these issues. Her groundbreaking approach to royal duties broke with traditional protocols, bringing a more personal touch to her engagements. As a mother, she prioritized providing a normal upbringing for her sons, William and Harry, involving them in her humanitarian work. Diana's tumultuous marriage ended in divorce in 1996, but she remained a beloved figure. Her tragic death in a car accident in Paris led to a significant public outpouring of grief, highlighting her impact on the world and prompting discussions on media intrusion and privacy."
  },
  {
    "id": 2,
    "name": "Heath Ledger",
    "birth": "1979-04-04",
    "birth_place": "Perth, Australia",
    "death": "2008-01-22",
    "death_place": "New York City, USA",
    "cause_of_death": "Drug Overdose",
    "profile_pic": "https://upload.wikimedia.org/wikipedia/commons/e/ea/Heath_Ledger_%282%29.jpg",
    "bio": "Heath Ledger was an Australian actor and director acclaimed for his profound performances and dedication to his craft. Starting his acting career in Australian television and film during the 1990s, he moved to the United States to further his career. Ledger gained international attention with his role in '10 Things I Hate About You,' which showcased his charm and acting versatility. He continued to challenge himself with diverse roles in films like 'A Knight's Tale,' 'Monster's Ball,' and 'Lords of Dogtown.' His portrayal of Ennis Del Mar in 'Brokeback Mountain' earned him critical acclaim and an Academy Award nomination, highlighting his ability to delve deeply into complex characters. Ledger's most iconic role was the Joker in Christopher Nolan's 'The Dark Knight,' where his intense and haunting performance redefined the character and earned him a posthumous Academy Award for Best Supporting Actor. Off-screen, Ledger was known for his reluctance towards fame and focus on personal artistry. His untimely death from an accidental prescription drug overdose shocked the world and led to increased discussions about mental health and the pressures of Hollywood."
  },
  {
    "id": 3,
    "name": "Freddie Mercury",
    "birth": "1946-09-05",
    "birth_place": "Stone Town, Zanzibar",
    "death": "1991-11-24",
    "death_place": "London, England",
    "cause_of_death": "HIV/AIDS, disease",
    "profile_pic": "https://cdn.britannica.com/38/200938-050-E22981D1/Freddie-Mercury-Live-Aid-Queen-Wembley-Stadium-July-13-1985.jpg",
    "bio": "Freddie Mercury, born Farrokh Bulsara, was a British singer, songwriter, and record producer, celebrated as the flamboyant and charismatic frontman of the rock band Queen. Born in Zanzibar and educated in India before moving to England, Mercury had a rich cultural background that influenced his music. His four-octave vocal range and theatrical stage presence captivated audiences worldwide. Mercury wrote numerous hits for Queen, including 'Bohemian Rhapsody,' 'Killer Queen,' 'Somebody to Love,' and 'We Are the Champions.' His ability to blend different musical styles, from rock and opera to pop and disco, set Queen apart in the music industry. Mercury's performance at Live Aid in 1985 is often cited as one of the greatest live performances in rock history. Beyond music, he was known for his enigmatic personality and guarded personal life. In 1991, Mercury publicly acknowledged that he had been diagnosed with AIDS; he passed away the next day due to complications from the disease. His death brought significant attention to AIDS awareness and had a lasting impact on the fight against the disease. Mercury's legacy endures through his timeless music and influence on future generations of artists."
  },
  {
    "id": 4,
    "name": "Kurt Cobain",
    "birth": "1967-02-20",
    "birth_place": "Aberdeen, USA",
    "death": "1994-04-05",
    "death_place": "Seattle, USA",
    "cause_of_death": "Suicide",
    "profile_pic": "https://www.rollingstone.com/wp-content/uploads/2018/06/rs-184007-111170300.jpg?w=1581&h=1054&crop=1",
    "bio": "Kurt Cobain was an American musician, artist, and poet best known as the lead vocalist, guitarist, and primary songwriter of the influential grunge band Nirvana. Growing up in a troubled household in Aberdeen, Washington, Cobain found solace in music from a young age. Nirvana's breakthrough album 'Nevermind,' featuring the hit single 'Smells Like Teen Spirit,' brought grunge and alternative rock to mainstream attention in the early 1990s. Cobain's songwriting was characterized by its raw emotion, introspective lyrics, and critique of societal norms, resonating deeply with a generation of youth. Despite his success, Cobain struggled with fame, chronic health issues, and substance abuse. He was also an advocate for gender equality and LGBTQ+ rights, often speaking out against sexism and homophobia. Cobain's battle with depression and heroin addiction culminated in his tragic suicide at the age of 27, which shocked fans worldwide. His death highlighted the pressures of fame and sparked widespread conversations about mental health and the support systems available for artists. Cobain's influence continues to be felt in the music industry, and he remains an icon of alternative culture."
  },
  {
    "id": 5,
    "name": "Marilyn Monroe",
    "birth": "1926-06-01",
    "birth_place": "Los Angeles, USA",
    "death": "1962-08-05",
    "death_place": "Los Angeles, USA",
    "cause_of_death": "Drug Overdose",
    "profile_pic": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4e/Monroecirca1953.jpg/1024px-Monroecirca1953.jpg",
    "bio": "Marilyn Monroe, born Norma Jeane Mortenson, was an American actress, singer, and model who became a major sex symbol and cultural icon during the 1950s and early 1960s. Raised in foster homes and an orphanage, Monroe overcame a challenging childhood to become one of Hollywood's most enduring stars. She began her career as a model before transitioning to film, where her blonde bombshell persona was showcased in movies like 'Gentlemen Prefer Blondes,' 'How to Marry a Millionaire,' and 'The Seven Year Itch.' Despite often being typecast in comedic roles, Monroe sought to expand her acting range, studying at the Actors Studio and delivering a critically acclaimed performance in 'Bus Stop.' Beyond her on-screen work, Monroe challenged the strictures of Hollywood's studio system, founding her own production company to gain more control over her career. Her personal life, including high-profile marriages to Joe DiMaggio and Arthur Miller, attracted significant media attention. Monroe's struggle with mental health issues and substance abuse were well-documented, and her untimely death at 36 from a barbiturate overdose remains a subject of speculation and intrigue. Her legacy continues to influence popular culture, fashion, and discussions about the role of women in media."
  },
  {
    "id": 6,
    "name": "Paul Walker",
    "birth": "1973-09-12",
    "birth_place": "Glendale, USA",
    "death": "2013-11-30",
    "death_place": "Santa Clarita, USA",
    "cause_of_death": "Accident",
    "profile_pic": "https://upload.wikimedia.org/wikipedia/commons/9/91/PaulWalkerEdit-1.jpg",
    "bio": "Paul Walker was an American actor and philanthropist best known for his role as Brian O'Conner in the blockbuster 'Fast & Furious' film series. Born and raised in California, Walker began his career as a child actor, appearing in television shows and commercials. His breakout role came with the 1999 film 'Varsity Blues,' which led to further success in teen and action films. Walker's portrayal of the charismatic undercover agent in 'The Fast and the Furious' franchise earned him international fame and solidified his status as an action star. Beyond acting, Walker was deeply committed to humanitarian efforts. He founded Reach Out Worldwide (ROWW), a nonprofit organization that provides disaster relief to affected areas. Walker was also passionate about marine biology, having studied the subject in college, and participated in marine conservation initiatives. An avid car enthusiast, his love for cars extended beyond his on-screen persona. Walker's life was tragically cut short at the age of 40 when he died in a car accident during a charity event for ROWW. His passing prompted an outpouring of grief from fans and colleagues, and his legacy continues through his foundation and the continuation of the 'Fast & Furious' series, which has honored his memory."
  },
  {
    "id": 7,
    "name": "Bruce Lee",
    "birth": "1940-11-27",
    "birth_place": "San Francisco, USA",
    "death": "1973-07-20",
    "death_place": "Hong Kong",
    "cause_of_death": "Cerebral Edema, disease",
    "profile_pic": "https://upload.wikimedia.org/wikipedia/commons/0/02/Bruce-Lee-as-Kato-1967-retouched.jpg",
    "bio": "Bruce Lee, born Lee Jun-fan, was a Hong Kong-American martial artist, actor, and philosopher who is widely regarded as one of the most influential martial artists of all time. Born in San Francisco and raised in Hong Kong, Lee began his martial arts training under the tutelage of Wing Chun master Ip Man. He later developed his own martial arts philosophy, Jeet Kune Do, emphasizing adaptability, efficiency, and simplicity. Lee's move to the United States marked the beginning of his acting career, where he sought to break into Hollywood. Frustrated by the lack of substantial roles for Asian actors, he returned to Hong Kong and starred in films like 'The Big Boss' and 'Fist of Fury,' which broke box office records. His film 'Enter the Dragon' was released shortly after his death and became an international success, solidifying his global legacy. Beyond his martial arts prowess, Lee was a cultural bridge between East and West, challenging stereotypes and inspiring a new generation to take up martial arts. His writings and teachings continue to influence martial artists and actors. Lee died unexpectedly at the age of 32 from cerebral edema, a cause that has been the subject of much speculation. His philosophy and approach to life remain influential worldwide."
  },
  {
    "id": 8,
    "name": "Amy Winehouse",
    "birth": "1983-09-14",
    "birth_place": "London, England",
    "death": "2011-07-23",
    "death_place": "London, England",
    "cause_of_death": "Alcohol Poisoning",
    "profile_pic": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/cf/Amy_Winehouse_f4962007_crop.jpg/1024px-Amy_Winehouse_f4962007_crop.jpg",
    "bio": "Amy Winehouse was a British singer-songwriter known for her deep, expressive contralto vocals and her eclectic mix of musical genres, including soul, jazz, and R&B. Born in Southgate, London, Winehouse grew up in a family with a strong affinity for jazz music. She released her debut album 'Frank' in 2003, which received critical acclaim and was nominated for the Mercury Prize. Her 2006 follow-up album, 'Back to Black,' propelled her to international fame, winning five Grammy Awards, including Record of the Year and Song of the Year for 'Rehab.' Winehouse's music often drew from her personal struggles with relationships, addiction, and mental health, resonating with audiences for its raw honesty and emotional depth. Despite her talent, Winehouse faced significant challenges with substance abuse and legal issues, which were frequently publicized by the media. Her battle with addiction and the pressures of fame took a toll on her health and career. Winehouse died at the age of 27 from alcohol poisoning, joining the infamous '27 Club' of musicians who passed away at that age. Her death sparked conversations about the treatment of celebrities by the media and the importance of mental health support. Winehouse's influence continues to be felt in the music industry, inspiring a generation of artists."
  },
  {
    "id": 9,
    "name": "Steve Irwin",
    "birth": "1962-02-22",
    "birth_place": "Melbourne, Australia",
    "death": "2006-09-04",
    "death_place": "Port Douglas, Australia",
    "cause_of_death": "Accident",
    "profile_pic": "https://upload.wikimedia.org/wikipedia/commons/2/2e/Steve_Irwin.jpg",
    "bio": "Steve Irwin, affectionately known as 'The Crocodile Hunter,' was an Australian zookeeper, conservationist, and television personality renowned for his passion for wildlife and adventurous spirit. Born to naturalist parents, he grew up around animals at the Queensland Reptile and Fauna Park, which his parents founded. Irwin took over management of the park, later renamed Australia Zoo, and expanded its operations and conservation efforts. His television series, 'The Crocodile Hunter,' co-hosted with his wife Terri, showcased his enthusiastic and hands-on approach to wildlife, particularly reptiles. Irwin's charismatic personality and fearless interactions with dangerous animals captivated global audiences, raising awareness about wildlife conservation. He established the Steve Irwin Conservation Foundation and was involved in numerous environmental initiatives, including habitat preservation and anti-poaching efforts. Irwin's unexpected death at 44 occurred while filming an underwater documentary when a stingray's barb pierced his heart. His passing elicited an immense outpouring of grief and tributes from around the world. Irwin's legacy lives on through his family's continued work at Australia Zoo and their conservation projects, inspiring others to respect and protect wildlife."
  },
  {
    "id": 10,
    "name": "Chester Bennington",
    "birth": "1976-03-20",
    "birth_place": "Phoenix, USA",
    "death": "2017-07-20",
    "death_place": "Palos Verdes Estates, USA",
    "cause_of_death": "Suicide",
    "profile_pic": "https://upload.wikimedia.org/wikipedia/commons/thumb/6/6d/Linkin_Park-Rock_im_Park_2014-_by_2eight_3SC0327.jpg/1024px-Linkin_Park-Rock_im_Park_2014-_by_2eight_3SC0327.jpg",
    "bio": "Chester Bennington was an American singer, songwriter, and musician best known as the lead vocalist of the rock band Linkin Park. Born in Phoenix, Arizona, Bennington had a turbulent childhood marked by abuse and family issues, which later influenced his songwriting. Linkin Park's debut album 'Hybrid Theory' became a massive commercial success, blending genres like nu-metal and rap rock, and Bennington's powerful vocals were a defining element of the band's sound. Hits like 'In the End' and 'Numb' showcased his ability to convey intense emotions, connecting with fans worldwide. Bennington was also involved with other musical projects, including fronting the bands Dead by Sunrise and Stone Temple Pilots. Throughout his career, he was open about his struggles with depression, addiction, and past traumas. Bennington's death by suicide at the age of 41 shocked the music community and highlighted the importance of mental health awareness. His passing led to increased dialogue about mental health support and the pressures faced by artists. Linkin Park honored his memory with a tribute concert and paused their activities to grieve. Bennington's legacy endures through his music, which continues to inspire and resonate with listeners."
  },
  {
    "id": 11,
    "name": "Robin Williams",
    "birth": "1951-07-21",
    "birth_place": "Chicago, USA",
    "death": "2014-08-11",
    "death_place": "Paradise Cay, USA",
    "cause_of_death": "Suicide",
    "profile_pic": "https://upload.wikimedia.org/wikipedia/commons/0/05/Robin_Williams_2011a_%282%29.jpg",
    "bio": "Robin Williams was an American actor and comedian celebrated for his improvisational skills and wide range of memorable characters. Born in Chicago and raised in Michigan and California, Williams studied theater at the Juilliard School. He first gained fame as the alien Mork in the TV series 'Mork & Mindy,' showcasing his quick wit and exuberant humor. Williams transitioned to film, delivering both comedic and dramatic performances in movies like 'Good Morning, Vietnam,' 'Dead Poets Society,' 'Mrs. Doubtfire,' and 'Good Will Hunting,' for which he won an Academy Award for Best Supporting Actor. Known for his ability to improvise and inhabit diverse roles, Williams entertained audiences with his unique blend of humor and pathos. Off-screen, he was involved in various charitable causes, including support for veterans and the homeless. Williams struggled with depression and addiction throughout his life, and his diagnosis of Lewy body dementia contributed to his declining health. His death by suicide at the age of 63 brought international attention to mental health issues and the challenges faced by those with neurological disorders. Williams's legacy continues through his extensive body of work, which remains influential in comedy and film."
  },
  {
    "id": 12,
    "name": "John Lennon",
    "birth": "1940-10-09",
    "birth_place": "Liverpool, England",
    "death": "1980-12-08",
    "death_place": "New York City, USA",
    "cause_of_death": "Assassination",
    "profile_pic": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSymcuSMhk-Y1eNRrh6JBT1p9scHF8wHkmIttL597AResh8tPRmb05Gj5RRmENeMvnGT8LvvJyVdeD2XXhwxmCM8g",
    "bio": "John Lennon was an English singer, songwriter, and peace activist who co-founded the Beatles, one of the most influential bands in the history of popular music. Born and raised in Liverpool, Lennon formed the Quarrymen, which evolved into the Beatles in 1960. Alongside Paul McCartney, he formed one of the most successful songwriting partnerships, creating timeless classics like 'Strawberry Fields Forever,' 'Imagine,' and 'All You Need Is Love.' Lennon's music evolved from early rock and roll to more experimental and socially conscious themes. After the Beatles disbanded in 1970, he pursued a solo career and continued his activism for peace, famously holding 'Bed-Ins for Peace' with his wife Yoko Ono. Lennon was known for his outspoken personality, wit, and advocacy for social justice. His assassination in 1980 outside his New York City apartment by a disturbed fan sent shockwaves around the world, leading to widespread mourning. Lennon's legacy endures through his music, writings, and the continued relevance of his messages promoting peace and understanding."
  },
  {
    "id": 13,
    "name": "Tupac Shakur",
    "birth": "1971-06-16",
    "birth_place": "New York City, USA",
    "death": "1996-09-13",
    "death_place": "Las Vegas, USA",
    "cause_of_death": "Assassination",
    "profile_pic": "https://cdn.britannica.com/02/162002-050-02512608/Tupac-Shakur-1993.jpg",
    "bio": "Tupac Amaru Shakur, known professionally as 2Pac, was an American rapper, actor, and poet considered one of the most influential figures in hip-hop history. Born in New York City, Shakur moved frequently during his youth before settling in California. His music tackled themes of social injustice, racism, poverty, and gang violence, reflecting his own experiences and the struggles of the African-American community. Albums like 'Me Against the World' and 'All Eyez on Me' are hailed as classics, showcasing his lyrical prowess and versatility. Shakur was also an actor, starring in films such as 'Juice,' 'Poetic Justice,' and 'Above the Rim.' His life was marked by controversy, including legal issues and a highly publicized feud with East Coast rapper The Notorious B.I.G. Tupac was fatally shot in a drive-by shooting in Las Vegas at the age of 25, a case that remains unsolved. His death intensified the discourse on violence within the hip-hop community. Shakur's influence extends beyond music; he is celebrated for his activism, artistry, and the depth of his messages, which continue to resonate with new generations."
  },
  {
    "id": 14,
    "name": "Elvis Presley",
    "birth": "1935-01-08",
    "birth_place": "Tupelo, USA",
    "death": "1977-08-16",
    "death_place": "Memphis, USA",
    "cause_of_death": "Heart Attack, disease",
    "profile_pic": "https://cdn.britannica.com/85/202285-050-EF215325/Elvis-Presley-Girl-Happy-Boris-Sagal.jpg",
    "bio": "Elvis Presley, often referred to as the 'King of Rock and Roll,' was an American singer and actor who became one of the most significant cultural icons of the 20th century. Born in Tupelo, Mississippi, Presley moved to Memphis, Tennessee, with his family at age 13. He began his music career in 1954 with Sun Records, bringing together influences from African-American blues, Christian gospel, and Southern country music. His energetic music and provocative performance style, exemplified in songs like 'Heartbreak Hotel,' 'Hound Dog,' and 'Jailhouse Rock,' captivated a diverse audience and ushered in a new era of American music and popular culture. Presley also had a successful acting career, starring in over 30 films. Despite his fame, he faced personal struggles, including prescription drug abuse and health issues exacerbated by his demanding schedule. Elvis's death at the age of 42 from heart failure shocked fans worldwide and led to widespread mourning. His home, Graceland, became a pilgrimage site for fans. Presley's influence on music, fashion, and popular culture is immeasurable, and he remains an enduring figure in American history."
  },
  {
    "id": 15,
    "name": "James Dean",
    "birth": "1931-02-08",
    "birth_place": "Marion, USA",
    "death": "1955-09-30",
    "death_place": "Cholame, USA",
    "cause_of_death": "Accident",
    "profile_pic": "https://hips.hearstapps.com/hmg-prod/images/james-dean.jpg?resize=1200:*",
    "bio": "James Dean was an American actor who became a cultural icon of teenage disillusionment and social estrangement, epitomized by his most celebrated film, 'Rebel Without a Cause.' Born in Marion, Indiana, Dean moved to New York City to pursue acting, studying under Lee Strasberg at the Actors Studio. His method acting technique brought a new level of intensity to the screen. Dean's film career comprised only three leading roles: 'East of Eden,' 'Rebel Without a Cause,' and 'Giant,' all released between 1955 and 1956. Despite his brief career, his performances left a lasting impact on cinema. Off-screen, Dean was passionate about car racing, which ultimately led to his untimely death at the age of 24 in a car accident while driving his Porsche 550 Spyder. Dean's tragic death cemented his status as a legend and symbol of youthful rebellion. He was the first actor to receive a posthumous Academy Award nomination for Best Actor. Dean's influence is seen in numerous artists and continues to be a subject of fascination in popular culture."
  },
  {
    "id": 16,
    "name": "Avicii",
    "birth": "1989-09-08",
    "birth_place": "Stockholm, Sweden",
    "death": "2018-04-20",
    "death_place": "Muscat, Oman",
    "cause_of_death": "Suicide",
    "profile_pic": "https://pbs.twimg.com/media/DUjJ38cW4AAPBy2?format=jpg&name=large",
    "bio": "Tim Bergling, known professionally as Avicii, was a Swedish DJ, remixer, and record producer who was a leading figure in the electronic dance music (EDM) movement of the early 2010s. Born in Stockholm, Bergling began remixing and producing tracks at a young age, posting his work on online forums. His breakthrough came with the 2011 single 'Levels,' which became a global hit and introduced EDM to mainstream audiences. Avicii's debut studio album, 'True,' featured the hit 'Wake Me Up,' blending EDM with elements of folk and country music. His innovative approach expanded the boundaries of the genre. Despite his success, Bergling struggled with health issues exacerbated by the demands of touring and alcohol use. In 2016, he retired from live performances to focus on his health and craftsmanship in the studio. Avicii's death by suicide at the age of 28 shocked the music world and drew attention to the mental health challenges faced by artists in the industry. Posthumously, his family established the Tim Bergling Foundation to support mental health awareness and suicide prevention. Avicii's legacy lives on through his music, which continues to inspire fans and fellow musicians."
  },
  {
    "id": 17,
    "name": "Selena Quintanilla",
    "birth": "1971-04-16",
    "birth_place": "Lake Jackson, USA",
    "death": "1995-03-31",
    "death_place": "Corpus Christi, USA",
    "cause_of_death": "Assassination",
    "profile_pic": "https://upload.wikimedia.org/wikipedia/commons/6/67/Selena_in_1995.jpg",
    "bio": "Selena Quintanilla, known simply as Selena, was an American singer, songwriter, and fashion designer who became one of the most celebrated Mexican-American entertainers of the late 20th century. Born in Texas, Selena began performing as a child in her family's band, Selena y Los Dinos. She helped popularize Tejano music, a fusion of Mexican and American influences, traditionally male-dominated. Her albums, such as 'Entre a Mi Mundo' and 'Amor Prohibido,' achieved record-breaking sales, and she won a Grammy for Best Mexican-American Album for 'Live!' in 1994. Selena was also a successful entrepreneur, opening boutiques and designing a clothing line. Known for her heartfelt performances and connection with fans, she was poised for crossover success into the English-language market. Her life was tragically cut short at the age of 23 when she was shot and killed by the president of her fan club, Yolanda Saldívar, over financial disputes. Selena's death had a profound impact on the Latino community and led to an outpouring of grief. Posthumously, her story has been told through films, books, and television series, preserving her legacy as the 'Queen of Tejano Music.'"
  },
  {
    "id": 18,
    "name": "Grace Hopper",
    "birth": "1906-12-09",
    "birth_place": "New York City, USA",
    "death": "1992-01-01",
    "death_place": "Arlington, USA",
    "cause_of_death": "Natural Causes, disease",
    "profile_pic": "https://upload.wikimedia.org/wikipedia/commons/thumb/9/98/Commodore_Grace_M._Hopper%2C_USN_%28covered%29_head_and_shoulders_crop.jpg/1280px-Commodore_Grace_M._Hopper%2C_USN_%28covered%29_head_and_shoulders_crop.jpg",
    "bio": "Grace Murray Hopper was an American computer scientist, mathematician, and United States Navy rear admiral who was a pioneer in the field of computer programming. She was one of the first programmers of the Harvard Mark I computer during World War II and developed the first compiler for a computer programming language, which was a monumental step in the evolution of computer science. Hopper's work led to the development of COBOL (Common Business-Oriented Language), one of the earliest high-level programming languages, making programming more accessible and machine-independent. She was known for her advocacy of machine-independent programming languages, which allowed programs to be written in a form that could run on multiple types of computers. Hopper is also credited with popularizing the term 'debugging' after a moth was found causing an error in the Mark II computer. Throughout her career, she was a strong proponent of innovation and education in computing. Hopper received numerous honors, including the National Medal of Technology and Innovation and posthumously the Presidential Medal of Freedom. Her legacy continues to inspire generations of computer scientists, and the Grace Hopper Celebration of Women in Computing is held annually in her honor."
  },
  {
    "id": 19,
    "name": "Whitney Houston",
    "birth": "1963-08-09",
    "birth_place": "Newark, USA",
    "death": "2012-02-11",
    "death_place": "Beverly Hills, USA",
    "cause_of_death": "Drowning",
    "profile_pic": "https://upload.wikimedia.org/wikipedia/commons/4/4e/Flickr_Whitney_Houston_performing_on_GMA_2009_6.jpg",
    "bio": "Whitney Houston was an American singer and actress renowned for her powerful, soulful voice and vocal versatility. Born into a musical family, with her mother Cissy Houston and cousin Dionne Warwick being prominent singers, Houston began singing in church as a child. She was discovered by Arista Records chairman Clive Davis, leading to a successful debut album at the age of 22. Houston became one of the best-selling music artists of all time, with hits like 'I Will Always Love You,' 'Greatest Love of All,' and 'How Will I Know.' She was the first artist to achieve seven consecutive number-one Billboard Hot 100 hits. Houston also pursued acting, starring in films like 'The Bodyguard' and 'Waiting to Exhale,' with 'The Bodyguard' soundtrack becoming one of the best-selling albums worldwide. Despite her professional success, Houston faced personal challenges, including a tumultuous marriage to singer Bobby Brown and struggles with substance abuse. Her unexpected death at the age of 48 occurred on the eve of the 2012 Grammy Awards, when she was found drowned in a hotel bathtub, with heart disease and cocaine use cited as contributing factors. Houston's legacy lives on through her music, which continues to influence and inspire artists around the world."
  },
  {
    "id": 20,
    "name": "Chadwick Boseman",
    "birth": "1976-11-29",
    "birth_place": "Anderson, USA",
    "death": "2020-08-28",
    "death_place": "Los Angeles, USA",
    "cause_of_death": "Cancer, disease",
    "profile_pic": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/40/Chadwick_Boseman_%2828017825484%29_%28cropped_2%29.jpg/1024px-Chadwick_Boseman_%2828017825484%29_%28cropped_2%29.jpg",
    "bio": "Chadwick Boseman was an American actor and playwright celebrated for his portrayals of historical figures and his role as a superhero in the Marvel Cinematic Universe. Born in Anderson, South Carolina, Boseman graduated from Howard University and studied acting at the British American Drama Academy in Oxford. Early in his career, he wrote and directed plays while teaching acting. Boseman's breakthrough came with his portrayal of baseball legend Jackie Robinson in '42,' followed by roles as James Brown in 'Get on Up' and Thurgood Marshall in 'Marshall,' showcasing his ability to capture the essence of real-life icons. In 2016, he debuted as T'Challa/Black Panther in 'Captain America: Civil War,' leading to the standalone film 'Black Panther' in 2018. The film was a cultural phenomenon, praised for its representation and impact on the portrayal of African and African-American culture in cinema. Boseman's performance was lauded for bringing depth and dignity to the character. Privately, he was diagnosed with colon cancer in 2016 but chose to keep his illness out of the public eye while continuing to work on major film projects. His death at the age of 43 shocked fans worldwide and highlighted his remarkable dedication to his craft. Boseman's legacy includes his commitment to telling important stories and his influence on the film industry."
  },
  {
    "id": 21,
    "name": "Michael Jackson",
    "birth": "1958-08-29",
    "birth_place": "Gary, USA",
    "death": "2009-06-25",
    "death_place": "Los Angeles, USA",
    "cause_of_death": "Cardiac Arrest, disease",
    "profile_pic": "https://people.com/thmb/lhO9lu-03uXN7jsWlk9TY0mhW0o=/4000x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(709x499:711x501)/michael-jackson-210aa5866c7d4dd58de8e3af57fe919a.jpg",
    "bio": "Michael Jackson was an American singer, songwriter, and dancer, hailed as the 'King of Pop' and one of the most significant cultural figures of the 20th century. Starting his career as the lead vocalist of The Jackson 5 during his childhood, he embarked on a solo career in 1971. Jackson's 1982 album 'Thriller' remains the best-selling album of all time, featuring groundbreaking music videos that transformed the medium into an art form and promotional tool. Known for his distinctive voice, moonwalk dance, and genre-spanning music, Jackson's hits include 'Billie Jean,' 'Beat It,' and 'Man in the Mirror.' He broke racial barriers on MTV and influenced artists across multiple genres. Despite his immense success, Jackson's personal life was marred by controversy and legal issues, including accusations of child molestation, which he consistently denied. His health deteriorated due to stress and addiction to prescription medications. Jackson died at the age of 50 from acute propofol and benzodiazepine intoxication administered by his personal physician, leading to a conviction for involuntary manslaughter. His death prompted global mourning and a resurgence of interest in his music. Jackson's legacy endures through his contributions to music, dance, fashion, and philanthropy."
  },
  {
    "id": 22,
    "name": "Jimi Hendrix",
    "birth": "1942-11-27",
    "birth_place": "Seattle, USA",
    "death": "1970-09-18",
    "death_place": "London, England",
    "cause_of_death": "Drug Overdose",
    "profile_pic": "https://faroutmagazine.co.uk/static/uploads/1/2023/03/Jimi-Hendrix-in-colour-Copenhagen-1967-Bent-Rej-Far-Out-Magazine-F.jpg",
    "bio": "Jimi Hendrix was an American rock guitarist, singer, and songwriter widely regarded as one of the most influential electric guitarists in the history of popular music. Born in Seattle, Washington, Hendrix developed his musical skills while serving in the U.S. Army and later playing backup for various artists. His breakthrough came after moving to London in 1966, where he formed The Jimi Hendrix Experience. The band's albums 'Are You Experienced,' 'Axis: Bold as Love,' and 'Electric Ladyland' featured groundbreaking techniques, pioneering the use of feedback and distortion. Hendrix's performance at the Monterey Pop Festival and his rendition of 'The Star-Spangled Banner' at Woodstock became iconic moments in rock history. Known for his flamboyant style and innovative playing, Hendrix expanded the vocabulary of the electric guitar. Offstage, he struggled with fame and substance abuse. Hendrix died at the age of 27 from asphyxia due to barbiturate intoxication, joining the '27 Club' of musicians who died at that age. His posthumous releases and enduring influence continue to inspire guitarists and musicians worldwide. Hendrix was posthumously inducted into the Rock and Roll Hall of Fame and remains a symbol of the psychedelic rock era."
  },
  {
    "id": 23,
    "name": "Janis Joplin",
    "birth": "1943-01-19",
    "birth_place": "Port Arthur, USA",
    "death": "1970-10-04",
    "death_place": "Los Angeles, USA",
    "cause_of_death": "Drug Overdose",
    "profile_pic": "https://cdn.britannica.com/42/196042-050-4D7796D0/Janis-Joplin.jpg",
    "bio": "Janis Joplin was an American singer-songwriter known for her powerful mezzo-soprano vocals and her electric stage presence. Born in Port Arthur, Texas, Joplin began singing blues and folk music in local venues before moving to San Francisco's Haight-Ashbury counterculture scene. She became the lead singer of Big Brother and the Holding Company, gaining national attention with their performance at the Monterey Pop Festival in 1967. Joplin's renditions of songs like 'Piece of My Heart' and 'Summertime' showcased her emotive and raw vocal style. She later pursued a solo career, releasing albums like 'I Got Dem Ol' Kozmic Blues Again Mama!' and the posthumous 'Pearl,' which included hits like 'Me and Bobby McGee.' Joplin's music was characterized by its fusion of rock, blues, and soul, and she became an emblem of the 1960s counterculture and the women's liberation movement. Her personal life was marked by struggles with addiction and self-destructive behavior. Joplin died at the age of 27 from a heroin overdose, contributing to the mythology of the '27 Club.' Her legacy endures as one of the greatest female rock musicians, influencing countless artists with her dynamic performances and soulful singing."
  },
  {
    "id": 24,
    "name": "David Bowie",
    "birth": "1947-01-08",
    "birth_place": "London, England",
    "death": "2016-01-10",
    "death_place": "New York City, USA",
    "cause_of_death": "Cancer, disease",
    "profile_pic": "https://media.vanityfair.com/photos/56935aff030e898e45417924/master/w_2240,c_limit/david-bowie-dies-cancer-69.jpg",
    "bio": "David Bowie, born David Robert Jones, was an English singer-songwriter and actor known for his innovative work during the 1970s and for his distinctive voice and flamboyant stage presence. Bowie's career was marked by reinvention and visual presentation, creating alter egos like Ziggy Stardust and the Thin White Duke. His exploration of themes like gender, sexuality, and identity challenged societal norms and influenced popular culture. Albums like 'The Rise and Fall of Ziggy Stardust and the Spiders from Mars,' 'Heroes,' and 'Let's Dance' showcased his ability to blend and innovate musical styles, from rock and glam to electronic and soul. Beyond music, Bowie was an accomplished actor, appearing in films such as 'The Man Who Fell to Earth' and 'Labyrinth.' He maintained a lifelong interest in art and fashion, impacting trends and inspiring other artists. Bowie's final album, 'Blackstar,' was released just days before his death from liver cancer, serving as a poignant farewell. His passing prompted global tributes, reflecting his profound influence on music, art, and culture. Bowie's legacy is that of a trailblazing artist who continually pushed boundaries and reinvented himself."
  },
  {
    "id": 25,
    "name": "Philip Seymour Hoffman",
    "birth": "1967-07-23",
    "birth_place": "Fairport, USA",
    "death": "2014-02-02",
    "death_place": "New York City, USA",
    "cause_of_death": "Drug Overdose",
    "profile_pic": "https://upload.wikimedia.org/wikipedia/commons/f/f5/Philip_Seymour_Hoffman_2011.jpg",
    "bio": "Philip Seymour Hoffman was an American actor and director known for his versatile performances and his ability to deeply inhabit a wide range of characters. Born in Fairport, New York, Hoffman studied acting at New York University's Tisch School of the Arts. He gained recognition in the 1990s with supporting roles in films like 'Boogie Nights,' 'The Big Lebowski,' and 'Magnolia.' Hoffman's portrayal of Truman Capote in the biographical film 'Capote' earned him the Academy Award for Best Actor. He was praised for his work in films such as 'Almost Famous,' 'Doubt,' 'Charlie Wilson's War,' and 'The Master,' showcasing his talent for complex and often troubled characters. Hoffman was also an accomplished stage actor, receiving three Tony Award nominations. He struggled with addiction throughout his life, which he had publicly discussed. Hoffman's death at the age of 46 from an accidental combined drug intoxication shocked the entertainment industry and led to discussions about the pressures faced by actors and the need for support systems. His legacy includes a body of work that continues to be celebrated for its depth, nuance, and humanity."
  },
  {
    "id": 26,
    "name": "River Phoenix",
    "birth": "1970-08-23",
    "birth_place": "Madras, USA",
    "death": "1993-10-31",
    "death_place": "Los Angeles, USA",
    "cause_of_death": "Drug Overdose",
    "profile_pic": "https://m.media-amazon.com/images/M/MV5BM2E0MGI0MmItMWRlMy00OTAxLWJkM2QtMDRmMmZhZThhOGVmXkEyXkFqcGc@._V1_.jpg",
    "bio": "River Phoenix was an American actor, musician, and activist celebrated for his talent and considered one of the most promising actors of his generation. Born into a nomadic family, Phoenix began his acting career on television before making his film debut in 'Explorers.' His breakout role was in 'Stand by Me,' where he played a sensitive and troubled boy, garnering critical acclaim at the age of 15. Phoenix earned an Academy Award nomination for Best Supporting Actor for 'Running on Empty' and delivered notable performances in films like 'My Own Private Idaho' and 'The Mosquito Coast.' Off-screen, he was known for his environmental activism, animal rights advocacy, and commitment to social causes. Phoenix's life was marred by the pressures of early fame and struggles with substance abuse. He died at the age of 23 from a drug overdose outside the Viper Room nightclub in Hollywood, a death that was widely publicized and mourned. His passing highlighted the vulnerabilities of young actors in Hollywood. Phoenix's influence on cinema endures, and he is remembered for his emotive performances and potential that was tragically cut short."
  },
  {
    "id": 27,
    "name": "Prince",
    "birth": "1958-06-07",
    "birth_place": "Minneapolis, USA",
    "death": "2016-04-21",
    "death_place": "Chanhassen, USA",
    "cause_of_death": "Drug Overdose",
    "profile_pic": "https://www.songhall.org/images/uploads/news/Prince-in-cobalt-blue.jpg",
    "bio": "Prince Rogers Nelson, known mononymously as Prince, was an American singer-songwriter, multi-instrumentalist, and producer recognized for his eclectic work, flamboyant stage presence, and wide vocal range. Born and raised in Minneapolis, Minnesota, Prince was a musical prodigy, releasing his debut album at the age of 19, on which he played all instruments. He achieved breakthrough success with albums like '1999,' 'Purple Rain,' and 'Sign o' the Times,' blending genres like funk, rock, R&B, and pop. His hits include 'When Doves Cry,' 'Kiss,' and 'Little Red Corvette.' Prince was known for his innovative music videos and bold fashion. He challenged industry norms by fighting for control over his music and was a pioneer in releasing music online. Prince was also a prolific songwriter for other artists and mentored emerging talent. Despite his public persona, he valued privacy and was involved in various philanthropic efforts quietly. Prince died at the age of 57 from an accidental fentanyl overdose at his Paisley Park estate. His death led to tributes worldwide and discussions on opioid addiction. Prince's influence on music and culture is profound, and he is celebrated as one of the greatest musicians of his generation."
  },
  {
    "id": 28,
    "name": "Alan Rickman",
    "birth": "1946-02-21",
    "birth_place": "London, England",
    "death": "2016-01-14",
    "death_place": "London, England",
    "cause_of_death": "Cancer, disease",
    "profile_pic": "https://upload.wikimedia.org/wikipedia/commons/f/fe/Alan_Rickman_after_Seminar_%283%29.jpg",
    "bio": "Alan Rickman was a distinguished British actor and director known for his deep voice and ability to portray complex antagonists. Born in London, Rickman initially pursued a career in graphic design before attending the Royal Academy of Dramatic Art. He gained prominence on stage with the Royal Shakespeare Company and received critical acclaim for his performance as the Vicomte de Valmont in 'Les Liaisons Dangereuses.' Rickman's film debut as the villain Hans Gruber in 'Die Hard' established him as a notable antagonist in cinema. He portrayed a range of characters in films such as 'Robin Hood: Prince of Thieves,' 'Sense and Sensibility,' and 'Galaxy Quest.' Rickman is perhaps best known to global audiences for his role as Professor Severus Snape in the 'Harry Potter' film series, where his nuanced performance earned widespread praise. He also directed and starred in theatrical productions and films like 'The Winter Guest.' Rickman was respected for his dedication to his craft and his mentorship of younger actors. His death at the age of 69 from pancreatic cancer was met with an outpouring of tributes from fans and colleagues. Rickman's legacy includes a body of work that spans stage and screen, remembered for its depth and elegance."
  },
  {
    "id": 29,
    "name": "George Michael",
    "birth": "1963-06-25",
    "birth_place": "London, England",
    "death": "2016-12-25",
    "death_place": "Goring-on-Thames, England",
    "cause_of_death": "Heart Disease, disease",
    "profile_pic": "https://cdn.britannica.com/48/250948-050-8262760B/George-Michael-Wham-1987.jpg",
    "bio": "George Michael, born Georgios Kyriacos Panayiotou, was an English singer, songwriter, and record producer who rose to fame as a member of the pop duo Wham! before embarking on a successful solo career. Wham!'s hits like 'Wake Me Up Before You Go-Go' and 'Last Christmas' made them icons of the 1980s pop scene. Michael's solo debut album 'Faith' was a critical and commercial success, featuring chart-topping singles such as 'Faith,' 'Father Figure,' and 'One More Try.' Known for his soulful voice and introspective lyrics, Michael explored themes of love, sexuality, and social issues. He was a trailblazer in music videos, using the medium to express artistic vision. Michael faced personal and legal challenges, including struggles with his sexuality, substance abuse, and conflicts with record labels. He was also a philanthropist, supporting various charities and causes throughout his life. Michael died at the age of 53 from heart and liver disease, prompting tributes that highlighted his contributions to music and his generosity. His legacy includes over 115 million records sold worldwide and influence on artists across genres."
  },
  {
    "id": 30,
    "name": "Anton Yelchin",
    "birth": "1989-03-11",
    "birth_place": "Saint Petersburg, Russia",
    "death": "2016-06-19",
    "death_place": "Los Angeles, USA",
    "cause_of_death": "Accident",
    "profile_pic": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/46/Anton_Yelchin_2011.jpg/1024px-Anton_Yelchin_2011.jpg",
    "bio": "Anton Yelchin was a Russian-American actor known for his versatility and talent at a young age. Born in Leningrad (now Saint Petersburg), Russia, Yelchin emigrated to the United States with his parents, professional figure skaters, as refugees from political and religious oppression. Yelchin began acting as a child, appearing in films like 'Hearts in Atlantis' and 'Alpha Dog.' He gained wider recognition for his role as Pavel Chekov in the 'Star Trek' reboot films, where he brought charm and humor to the character. Yelchin also starred in independent and critically acclaimed films such as 'Like Crazy,' 'Green Room,' and 'Only Lovers Left Alive,' showcasing his range as an actor. He was admired for his dedication to his craft and for choosing diverse and challenging roles. Yelchin's life was tragically cut short at the age of 27 due to a freak accident at his home, where his vehicle rolled backward and pinned him against a brick pillar and security fence. His untimely death shocked the film community and fans alike. Posthumously, his work continues to be celebrated, and a documentary titled 'Love, Antosha' was released, highlighting his life and career."
  },
  {
    "id": 31,
    "name": "Chris Cornell",
    "birth": "1964-07-20",
    "birth_place": "Seattle, USA",
    "death": "2017-05-18",
    "death_place": "Detroit, USA",
    "cause_of_death": "Suicide",
    "profile_pic": "https://media.npr.org/assets/img/2018/10/25/gettyimages-124719357-0a9fa5c596814d00bada8b0e978df78b82d3869d.jpg",
    "bio": "Chris Cornell was an American musician, singer, and songwriter best known as the lead vocalist for the rock bands Soundgarden and Audioslave. Born in Seattle, Washington, Cornell became a central figure in the grunge movement of the early 1990s. Soundgarden's albums, such as 'Badmotorfinger' and 'Superunknown,' featured Cornell's powerful four-octave vocal range and introspective lyrics. Hits like 'Black Hole Sun' and 'Spoonman' brought the band mainstream success. After Soundgarden disbanded, Cornell pursued solo projects and later formed Audioslave with members of Rage Against the Machine, blending hard rock with political themes. Cornell was also involved in Temple of the Dog, a tribute to his friend Andrew Wood. His songwriting often explored themes of existentialism, depression, and hope. Cornell struggled with substance abuse and depression throughout his life. His death by suicide at the age of 52 occurred shortly after a concert in Detroit, leading to tributes from artists and fans worldwide. Cornell's contributions to music continue to influence and inspire, solidifying his legacy as one of the greatest rock vocalists."
  },
  {
    "id": 32,
    "name": "Anthony Bourdain",
    "birth": "1956-06-25",
    "birth_place": "New York City, USA",
    "death": "2018-06-08",
    "death_place": "Kaysersberg, France",
    "cause_of_death": "Suicide",
    "profile_pic": "https://upload.wikimedia.org/wikipedia/commons/a/a5/Anthony_Bourdain_Peabody_2014b.jpg",
    "bio": "Anthony Bourdain was an American celebrity chef, author, and travel documentarian known for his exploration of international culture, cuisine, and the human condition. Born in New York City and raised in New Jersey, Bourdain developed a passion for food early in life. He graduated from the Culinary Institute of America and worked in various professional kitchens, eventually becoming the executive chef at Brasserie Les Halles in Manhattan. Bourdain's candid memoir, 'Kitchen Confidential: Adventures in the Culinary Underbelly,' brought him fame and launched his television career. He hosted shows like 'No Reservations' and 'Parts Unknown,' where he traveled the world to explore food and culture, emphasizing storytelling and authenticity. Bourdain was celebrated for his curiosity, wit, and ability to connect with people from all walks of life. He was also an outspoken advocate for marginalized communities and social issues. Bourdain's death by suicide at the age of 61 while filming in France shocked fans and colleagues, prompting conversations about mental health in the culinary and entertainment industries. His legacy includes a body of work that transcends food, highlighting the shared humanity across cultures."
  },
  {
    "id": 33,
    "name": "Mac Miller",
    "birth": "1992-01-19",
    "birth_place": "Pittsburgh, USA",
    "death": "2018-09-07",
    "death_place": "Los Angeles, USA",
    "cause_of_death": "Drug Overdose",
    "profile_pic": "https://pyxis.nymag.com/v1/imgs/f64/d14/ce3f3a568c6511537d537050da8a5000fe-04-mac-miller-1.2x.rvertical.w600.jpg",
    "bio": "Mac Miller, born Malcolm James McCormick, was an American rapper, singer, and record producer known for his introspective lyrics and musical versatility. Growing up in Pittsburgh, Pennsylvania, Miller began his music career at a young age, releasing mixtapes that garnered local attention. His debut studio album, 'Blue Slide Park,' debuted at number one on the Billboard 200, making him the first independently distributed artist to top the chart since 1995. Miller's music evolved over time, exploring themes of love, fame, and personal struggles, with albums like 'Watching Movies with the Sound Off,' 'GO:OD AM,' and 'The Divine Feminine.' He was praised for his candidness about mental health and substance abuse. Miller also produced music under the pseudonym Larry Fisherman. His collaborations spanned various genres and included work with artists like Ariana Grande, Thundercat, and Kendrick Lamar. Miller died at the age of 26 from an accidental overdose of fentanyl, cocaine, and alcohol, highlighting the ongoing opioid crisis. His death was widely mourned in the music community, and his posthumous album 'Circles' was released to critical acclaim. Miller's legacy includes his influence on younger artists and his contributions to hip-hop."
  },
  {
    "id": 34,
    "name": "Cory Monteith",
    "birth": "1982-05-11",
    "birth_place": "Calgary, Canada",
    "death": "2013-07-13",
    "death_place": "Vancouver, Canada",
    "cause_of_death": "Drug Overdose",
    "profile_pic": "https://upload.wikimedia.org/wikipedia/commons/5/53/Cory_Monteith_2%2C_2011.jpg",
    "bio": "Cory Monteith was a Canadian actor and musician best known for his role as Finn Hudson on the television series 'Glee.' Born in Calgary and raised in Victoria, British Columbia, Monteith faced challenges in his youth, including dropping out of school and struggling with substance abuse. He cleaned up his life and pursued acting, landing roles in shows like 'Kyle XY' and films like 'Final Destination 3.' Monteith's breakthrough came with 'Glee,' where his portrayal of the lovable quarterback turned glee club member resonated with audiences. His performances showcased his singing abilities and contributed to the show's success. Monteith was open about his past struggles and advocated for youth dealing with similar issues. Despite attempts at recovery, he relapsed and died at the age of 31 from a mixed drug toxicity involving heroin and alcohol. His death highlighted the difficulties of overcoming addiction and the pressures of fame. Monteith's loss was deeply felt by fans and colleagues, leading to tributes both on and off the show. His legacy includes his contributions to 'Glee' and his efforts to support at-risk youth."
  },
  {
    "id": 35,
    "name": "Aaliyah",
    "birth": "1979-01-16",
    "birth_place": "New York City, USA",
    "death": "2001-08-25",
    "death_place": "Marsh Harbour, Bahamas",
    "cause_of_death": "Accident",
    "profile_pic": "https://upload.wikimedia.org/wikipedia/commons/1/14/Aaliyah-02.jpg",
    "bio": "Aaliyah Dana Haughton, known professionally as Aaliyah, was an American singer, actress, and model who played a significant role in redefining R&B and pop music in the 1990s. Born in Brooklyn and raised in Detroit, she signed a recording contract at the age of 12. Her debut album, 'Age Ain't Nothing but a Number,' was certified double platinum and established her as a rising star. Collaborating with producers like Timbaland and Missy Elliott, Aaliyah's subsequent albums 'One in a Million' and the self-titled 'Aaliyah' featured innovative production and mature themes, influencing a new wave of artists. Hits like 'Try Again' and 'Are You That Somebody' showcased her smooth vocals and dance abilities. Aaliyah also pursued acting, appearing in films such as 'Romeo Must Die' and 'Queen of the Damned.' Tragically, she died at the age of 22 in a plane crash in the Bahamas after filming a music video. The crash was attributed to an overloaded aircraft and improperly licensed pilot. Aaliyah's death shocked the music industry and her fans, prompting discussions on aviation safety. Her legacy endures through her music, fashion influence, and impact on contemporary R&B."
  },
  {
    "id": 36,
    "name": "Jeff Buckley",
    "birth": "1966-11-17",
    "birth_place": "Anaheim, USA",
    "death": "1997-05-29",
    "death_place": "Memphis, USA",
    "cause_of_death": "Drowning",
    "profile_pic": "https://m.media-amazon.com/images/M/MV5BOTE2ODU5MzExMl5BMl5BanBnXkFtZTgwOTkxNTk2NjM@._V1_.jpg",
    "bio": "Jeff Buckley was an American singer-songwriter and guitarist celebrated for his haunting voice and emotive performances. Born in Anaheim, California, Buckley was the son of musician Tim Buckley but was raised by his mother and stepfather. He honed his musical talents in Los Angeles before moving to New York City, where he gained attention performing in cafes and clubs. Buckley's only studio album, 'Grace,' released in 1994, showcased his broad vocal range and eclectic influences, blending rock, folk, jazz, and classical elements. The album included his acclaimed cover of Leonard Cohen's 'Hallelujah,' which became his signature song. Despite critical praise, 'Grace' initially had modest commercial success, but Buckley amassed a dedicated following. He was known for his intense live performances and poetic songwriting. Buckley's life was tragically cut short at the age of 30 when he drowned during a spontaneous swim in the Wolf River Harbor in Memphis, Tennessee. His death sent shockwaves through the music community. Posthumously released recordings and tributes have kept his music alive, and his influence is recognized by artists across genres. Buckley's legacy is that of a gifted artist whose potential was unrealized due to his untimely passing."
  },
  {
    "id": 37,
    "name": "Mahatma Gandhi",
    "birth": "1869-10-02",
    "birth_place": "Porbandar, India",
    "death": "1948-01-30",
    "death_place": "New Delhi, India",
    "cause_of_death": "Assassination",
    "profile_pic": "https://www.indilaya.de/images/product_images/info_images/briefkarte-mahatmagandhi-1.jpeg",
    "bio": "Mohandas Karamchand Gandhi, commonly known as Mahatma Gandhi, was an Indian lawyer, anti-colonial nationalist, and political ethicist who employed nonviolent resistance to lead the successful campaign for India's independence from British rule. Born in Porbandar, Gujarat, Gandhi studied law in London before working in South Africa, where he first employed civil disobedience in the struggle against racial discrimination. Returning to India, he became a leader of the Indian National Congress and organized nationwide campaigns for easing poverty, expanding women's rights, religious harmony, and self-rule. Gandhi's methodologies of satyagraha (truth and firmness) and ahimsa (nonviolence) inspired movements for civil rights and freedom across the world. Notable events like the Salt March and the Quit India Movement were pivotal in challenging British authority. Despite his dedication to peace, Gandhi faced imprisonment multiple times. On January 30, 1948, he was assassinated by Nathuram Godse, a Hindu nationalist who opposed Gandhi's views on partition and communal harmony. Gandhi's teachings continue to influence global leaders and movements advocating for civil rights and social change."
  },
  {
    "id": 38,
    "name": "Jim Morrison",
    "birth": "1943-12-08",
    "birth_place": "Melbourne, USA",
    "death": "1971-07-03",
    "death_place": "Paris, France",
    "cause_of_death": "Heart Failure, disease",
    "profile_pic": "https://ntvb.tmsimg.com/assets/assets/71044_v9_ba.jpg?w=360&h=480",
    "bio": "Jim Morrison was an American singer, songwriter, and poet best known as the lead vocalist of the rock band The Doors. Born in Melbourne, Florida, Morrison was a charismatic and enigmatic figure whose poetic lyrics and wild personality made him a countercultural icon. The Doors formed in 1965, blending rock, blues, and psychedelia, and produced hits like 'Light My Fire,' 'Riders on the Storm,' and 'Break On Through.' Morrison's performances were known for their theatricality and unpredictability, often pushing the boundaries of social conventions. His fascination with surrealism, existentialism, and shamanism influenced his songwriting and persona. Morrison struggled with fame and substance abuse, leading to legal troubles and erratic behavior. Seeking refuge, he moved to Paris in 1971, where he died at the age of 27 from heart failure under mysterious circumstances, contributing to the '27 Club' mythology. Morrison's grave in Père Lachaise Cemetery has become a pilgrimage site for fans. His legacy endures through his music, poetry, and the enduring appeal of The Doors, influencing generations of musicians and artists."
  },
  {
    "id": 39,
    "name": "Buddy Holly",
    "birth": "1936-09-07",
    "birth_place": "Lubbock, USA",
    "death": "1959-02-03",
    "death_place": "Clear Lake, USA",
    "cause_of_death": "Accident",
    "profile_pic": "https://m.media-amazon.com/images/I/611+9OeGuJL._UF1000,1000_QL80_.jpg",
    "bio": "Buddy Holly, born Charles Hardin Holley, was an American singer-songwriter and a pioneer of rock and roll music in the mid-1950s. Growing up in Lubbock, Texas, Holly was influenced by gospel, country, and rhythm and blues, developing a unique style that combined these genres. His band, The Crickets, produced hits like 'That'll Be the Day,' 'Peggy Sue,' and 'Not Fade Away,' characterized by innovative guitar playing and expressive vocals. Holly's approach to music, including his involvement in songwriting and production, set a precedent for future rock artists. He was one of the first to use studio techniques like double-tracking and overdubbing. Holly's career was tragically cut short when he died at the age of 22 in a plane crash alongside fellow musicians Ritchie Valens and J.P. 'The Big Bopper' Richardson, an event later referred to as 'The Day the Music Died.' Despite his brief career, Holly's influence on music was profound, inspiring artists like The Beatles, The Rolling Stones, and Bob Dylan. He is remembered as a foundational figure in the development of rock music."
  },
  {
    "id": 40,
    "name": "Sharon Tate",
    "birth": "1943-01-24",
    "birth_place": "Dallas, USA",
    "death": "1969-08-09",
    "death_place": "Los Angeles, USA",
    "cause_of_death": "Murder",
    "profile_pic": "https://goldenglobes.com/wp-content/uploads/2023/10/sharon_tate.jpg?w=600?w=600",
    "bio": "Sharon Tate was an American actress and model who became a symbol of the 1960s Hollywood glamour. Born in Dallas, Texas, Tate began her career with small television roles and gained recognition for her performances in films like 'Valley of the Dolls,' for which she received a Golden Globe nomination, and 'The Fearless Vampire Killers,' directed by her future husband Roman Polanski. Tate was known for her beauty and rising talent, often being cast in roles that showcased her charm and comedic abilities. Her personal life and marriage to Polanski were the subjects of media attention. Tragically, Tate was murdered at the age of 26 by members of the Manson Family cult while eight and a half months pregnant. The brutal killings sent shockwaves across the nation and marked a grim end to the carefree spirit of the 1960s. The trial of Charles Manson and his followers became one of the most notorious in American history. Tate's death has been the subject of numerous books and films, and she is remembered for her potential as an actress and the tragic circumstances of her passing."
  },
  {
    "id": 41,
    "name": "John Belushi",
    "birth": "1949-01-24",
    "birth_place": "Chicago, USA",
    "death": "1982-03-05",
    "death_place": "Los Angeles, USA",
    "cause_of_death": "Drug Overdose",
    "profile_pic": "https://faroutmagazine.co.uk/static/uploads/1/2021/01/John-Belushi.jpg",
    "bio": "John Belushi was an American comedian, actor, and musician known for his energetic and chaotic style. Born in Chicago to Albanian immigrant parents, Belushi started his career at The Second City and later became one of the original cast members of 'Saturday Night Live' (SNL), where he created memorable characters like Samurai Futaba. His work on SNL propelled him to stardom, leading to film roles in 'Animal House,' where he played the iconic Bluto Blutarsky, and 'The Blues Brothers,' a project that originated from an SNL musical sketch with Dan Aykroyd. Belushi's talents extended to music, and The Blues Brothers became a legitimate band, releasing albums and touring. Despite professional success, Belushi struggled with drug addiction, which affected his health and work. He died at the age of 33 from a drug overdose involving a combination of cocaine and heroin. His death highlighted the dark side of fame and led to increased awareness of substance abuse in Hollywood. Belushi's legacy includes his influential comedic style and contributions to comedy and music."
  },
  {
    "id": 42,
    "name": "Patsy Cline",
    "birth": "1932-09-08",
    "birth_place": "Winchester, USA",
    "death": "1963-03-05",
    "death_place": "Camden, USA",
    "cause_of_death": "Accident",
    "profile_pic": "https://hips.hearstapps.com/clv.h-cdn.co/assets/17/16/1492451618-patsycline-landscape.jpg?crop=0.500xw:1.00xh;0.319xw,0&resize=1200:*",
    "bio": "Patsy Cline was an American country music singer who became one of the most influential vocalists of the 20th century. Born Virginia Patterson Hensley in Winchester, Virginia, Cline began performing in local clubs and on radio at a young age. She rose to fame with hits like 'Walkin' After Midnight,' 'I Fall to Pieces,' 'Crazy,' and 'Sweet Dreams,' which showcased her rich tone and emotional delivery. Cline was one of the first country artists to successfully cross over into pop music, broadening the genre's appeal. She faced challenges as a woman in the male-dominated country music industry but became a trailblazer for future female artists. Cline's career was marked by relentless touring and television appearances, solidifying her status as a leading entertainer. She died tragically at the age of 30 in a plane crash while returning from a benefit concert. Her death was a significant loss to the music world. Posthumously, Cline has been honored with numerous awards and inducted into the Country Music Hall of Fame. Her music continues to influence artists and resonate with fans worldwide."
  },
  {
    "id": 43,
    "name": "Sid Vicious",
    "birth": "1957-05-10",
    "birth_place": "London, England",
    "death": "1979-02-02",
    "death_place": "New York City, USA",
    "cause_of_death": "Drug Overdose",
    "profile_pic": "https://upload.wikimedia.org/wikipedia/en/3/34/Sid_Sings.jpg",
    "bio": "Sid Vicious, born John Simon Ritchie, was an English musician best known as the bassist of the punk rock band Sex Pistols. Born in London, Vicious joined the band in 1977, replacing original bassist Glen Matlock. Although his musical ability was limited, his image and attitude embodied the anarchic spirit of punk. Vicious became a notorious figure due to his tumultuous relationship with Nancy Spungen, substance abuse, and involvement in violence. The Sex Pistols disbanded after a chaotic U.S. tour, and Vicious attempted a solo career. In 1978, Spungen was found dead from a stab wound in the couple's hotel room, and Vicious was charged with her murder. He died of a heroin overdose at the age of 21 while out on bail, before the case could be resolved. Vicious's life and death have been the subject of media portrayal and debate, symbolizing the excesses of the punk movement. His legacy is controversial, reflecting both the raw energy of punk and the destructive consequences of fame and addiction."
  },
  {
    "id": 44,
    "name": "Anna Nicole Smith",
    "birth": "1967-11-28",
    "birth_place": "Houston, USA",
    "death": "2007-02-08",
    "death_place": "Hollywood, USA",
    "cause_of_death": "Drug Overdose",
    "profile_pic": "https://people.com/thmb/IoqOJtYUkCcs9aTGKCNLQi0XQc8=/750x0/filters:no_upscale():max_bytes(150000):strip_icc():focal(978x615:980x617)/anna-nicole-smith-644f9446466648649b93a73295c15b4d.jpg",
    "bio": "Anna Nicole Smith, born Vickie Lynn Hogan, was an American model, actress, and television personality who gained fame through her work with Playboy magazine and as a spokesmodel for Guess jeans. Born in Houston, Texas, Smith had a difficult upbringing before achieving success in modeling. She gained significant media attention after marrying 89-year-old billionaire J. Howard Marshall II at the age of 26, leading to legal battles over his estate following his death. Smith starred in her own reality TV show, 'The Anna Nicole Show,' which showcased her personal life and eccentric personality. She faced numerous personal challenges, including weight fluctuations, legal issues, and public scrutiny. Smith's son, Daniel, died from a drug overdose in 2006, which deeply affected her. She died at the age of 39 from an accidental overdose of prescription drugs in a hotel room in Florida. Her death sparked a highly publicized legal battle over the paternity and custody of her infant daughter, Dannielynn. Smith's life story reflects the complexities of fame and the impact of media sensationalism."
  },
  {
    "id": 45,
    "name": "Jean-Michel Basquiat",
    "birth": "1960-12-22",
    "birth_place": "Brooklyn, USA",
    "death": "1988-08-12",
    "death_place": "New York City, USA",
    "cause_of_death": "Drug Overdose",
    "profile_pic": "https://upload.wikimedia.org/wikipedia/en/5/51/Jean-Michel_Basquiat_1982_by_Andy_Warhol.png",
    "bio": "Jean-Michel Basquiat was an American artist of Haitian and Puerto Rican descent who rose to fame in the late 1970s and 1980s with his neo-expressionist paintings. Born in Brooklyn, New York, Basquiat began as a graffiti artist under the pseudonym SAMO, creating cryptic messages on Manhattan's Lower East Side. His work quickly gained attention for its raw energy, symbolism, and exploration of themes like race, class, and identity. Basquiat collaborated with influential artists, including Andy Warhol, and his work was exhibited in galleries worldwide. He was one of the youngest artists to participate in prestigious international exhibitions. Despite his success, Basquiat struggled with fame and drug addiction. He died at the age of 27 from a heroin overdose, joining the '27 Club' of artists who died at that age. Basquiat's legacy has grown posthumously, with his works commanding record-breaking prices at auctions. He is celebrated for his profound impact on art, breaking down barriers for minority artists, and addressing social issues that remain relevant."
  },
  {
    "id": 46,
    "name": "Dolores O'Riordan",
    "birth": "1971-09-06",
    "birth_place": "Ballybricken, Ireland",
    "death": "2018-01-15",
    "death_place": "London, England",
    "cause_of_death": "Drowning",
    "profile_pic": "https://upload.wikimedia.org/wikipedia/commons/9/9c/Dolores_O%27Riordan_2016_%28cropped%29.jpeg",
    "bio": "Dolores O'Riordan was an Irish musician, singer, and songwriter best known as the lead vocalist for the alternative rock band The Cranberries. Born in County Limerick, Ireland, O'Riordan joined The Cranberries in 1990. Her distinctive mezzo-soprano voice and yodeling-style vocals became the band's signature, featured in hits like 'Linger,' 'Dreams,' and 'Zombie,' the latter addressing the conflict in Northern Ireland. The band's success in the 1990s made them one of the most prominent groups of the decade. O'Riordan also pursued solo projects and collaborated with other artists. She was known for her honest songwriting, often drawing from personal experiences. O'Riordan faced challenges with mental health, including diagnoses of bipolar disorder and depression. She died at the age of 46 by accidental drowning in a hotel bathtub due to alcohol intoxication. Her death prompted tributes from fans and musicians worldwide, highlighting her influence on music and her role as a prominent female artist in rock. O'Riordan's legacy continues through her recordings and the impact she had on other artists."
  },
  {
    "id": 47,
    "name": "Jim Croce",
    "birth": "1943-01-10",
    "birth_place": "Philadelphia, USA",
    "death": "1973-09-20",
    "death_place": "Natchitoches, USA",
    "cause_of_death": "Accident",
    "profile_pic": "https://yt3.googleusercontent.com/jRhgqd-MAh9UB5f2muffvTQnr-M0fL5yaDF172jRuNSK0r4JTvF-NAx7fM_wjt3R-YAQXLD7amY=s900-c-k-c0x00ffffff-no-rj",
    "bio": "Jim Croce was an American folk and rock singer-songwriter known for his storytelling and memorable melodies. Born in Philadelphia, Pennsylvania, Croce began playing music in college and performed at small venues and coffeehouses. He released several albums with his wife Ingrid before gaining widespread recognition with his third album, 'You Don't Mess Around with Jim,' featuring hits like 'Operator' and the title track. His subsequent album, 'Life and Times,' included the hit 'Bad, Bad Leroy Brown,' which reached number one on the Billboard charts. Croce's music combined elements of folk, rock, and blues, resonating with audiences for its authenticity and relatability. Tragically, Croce died at the age of 30 in a plane crash while on tour in Louisiana. His song 'Time in a Bottle' became a posthumous number-one hit. Croce's sudden death cut short a promising career, but his music has endured, influencing singer-songwriters and continuing to receive radio play. His legacy is celebrated for its warmth, wit, and contribution to American music."
  },
  {
    "id": 48,
    "name": "Karen Carpenter",
    "birth": "1950-03-02",
    "birth_place": "New Haven, USA",
    "death": "1983-02-04",
    "death_place": "Downey, USA",
    "cause_of_death": "Heart Failure, disease",
    "profile_pic": "https://ntvb.tmsimg.com/assets/assets/80639_v9_aa.jpg",
    "bio": "Karen Carpenter was an American singer and drummer who, with her brother Richard Carpenter, formed the duo The Carpenters. Born in New Haven, Connecticut, and raised in Downey, California, Karen initially played drums before becoming known for her three-octave contralto vocals. The Carpenters achieved great success in the 1970s with hits like 'Close to You,' 'We've Only Just Begun,' and 'Rainy Days and Mondays.' Karen's warm voice and the duo's clean-cut image made them popular with a wide audience. Despite professional success, Karen struggled with anorexia nervosa, a little-understood eating disorder at the time. Her condition led to extreme weight loss and health complications. She sought treatment but died at the age of 32 from heart failure due to complications related to her anorexia. Karen Carpenter's death brought public attention to eating disorders, leading to increased research and awareness. Her legacy includes her contributions to music and the timeless quality of The Carpenters' songs, which continue to be celebrated for their craftsmanship and emotional resonance."
  },
  {
    "id": 49,
    "name": "Brittany Murphy",
    "birth": "1977-11-10",
    "birth_place": "Atlanta, USA",
    "death": "2009-12-20",
    "death_place": "Los Angeles, USA",
    "cause_of_death": "Pneumonia, disease",
    "profile_pic": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2c/Brittany_Murphy.jpg/1024px-Brittany_Murphy.jpg",
    "bio": "Brittany Murphy was an American actress and singer known for her versatile roles in film and television. Born in Atlanta, Georgia, Murphy moved to Los Angeles as a teenager to pursue acting. She gained prominence with her role as Tai Frasier in the 1995 teen comedy 'Clueless,' showcasing her comedic talent. Murphy expanded her repertoire with performances in films like 'Girl, Interrupted,' '8 Mile,' and 'Sin City,' demonstrating her ability to handle dramatic roles. She also lent her voice to the character Luanne Platter on the animated series 'King of the Hill.' Murphy had a brief music career, contributing to soundtracks and collaborating with artists. Her personal life faced scrutiny, and she appeared in fewer high-profile projects in later years. Murphy died at the age of 32 from pneumonia, anemia, and multiple drug intoxication. Her death raised questions and speculation due to the unusual circumstances, including the subsequent death of her husband Simon Monjack from similar causes. Murphy's talent and early passing left a lasting impact, and she is remembered for her engaging performances and potential unfulfilled."
  },
  {
    "id": 50,
    "name": "Elliott Smith",
    "birth": "1969-08-06",
    "birth_place": "Omaha, USA",
    "death": "2003-10-21",
    "death_place": "Los Angeles, USA",
    "cause_of_death": "Suicide",
    "profile_pic": "https://www.rollingstone.com/wp-content/uploads/2018/06/rs-13070-es-624-1382358082.jpg?w=624&h=420&crop=1",
    "bio": "Elliott Smith was an American singer-songwriter known for his whispered vocals and introspective songwriting. Born Steven Paul Smith in Omaha, Nebraska, he grew up in Texas and Portland, Oregon. Smith began his music career with the indie rock band Heatmiser before embarking on a solo career. His albums 'Either/Or' and 'XO' received critical acclaim, and his song 'Miss Misery' from the film 'Good Will Hunting' earned an Academy Award nomination. Smith's music often addressed themes of depression, addiction, and personal relationships, resonating with fans for its honesty and emotional depth. Despite his success, Smith struggled with substance abuse and mental health issues. He died at the age of 34 from two stab wounds to the chest, with the circumstances of his death leading to speculation about whether it was suicide or foul play. Smith's influence on indie music is significant, with many artists citing him as an inspiration. His posthumous releases and the continued appreciation of his work contribute to his enduring legacy."
  },
  {
    "id": 51,
    "name": "Marvin Gaye",
    "birth": "1939-04-02",
    "birth_place": "Washington, D.C., USA",
    "death": "1984-04-01",
    "death_place": "Los Angeles, USA",
    "cause_of_death": "Assassination",
    "profile_pic": "https://www.songhall.org/images/uploads/exhibits/MarvinGaye_by_Jim_Britt.jpg",
    "bio": "Marvin Gaye was an iconic American soul and R&B singer-songwriter who played a pivotal role in shaping the Motown sound of the 1960s and 1970s. Known for hits like 'What's Going On,' 'Let's Get It On,' and 'Sexual Healing,' Gaye's music often addressed social issues, love, and spirituality. His smooth vocals and profound lyrics made him a legendary figure in popular music. Tragically, Marvin Gaye was shot and killed by his father during a heated argument on April 1, 1984, just one day before his 45th birthday."
  },
  {
    "id": 52,
    "name": "Natalie Wood",
    "birth": "1938-07-20",
    "birth_place": "San Francisco, USA",
    "death": "1981-11-29",
    "death_place": "Santa Catalina Island, USA",
    "cause_of_death": "Drowning",
    "profile_pic": "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d4/Natalie_Wood_Allan_Warren.jpg/1024px-Natalie_Wood_Allan_Warren.jpg",
    "bio": "Natalie Wood was an acclaimed American actress who rose to fame as a child star and transitioned into a celebrated adult performer. She captivated audiences in classic films like 'Rebel Without a Cause,' 'West Side Story,' and 'Splendor in the Grass.' Wood's life was cut short in 1981 when she mysteriously drowned near Catalina Island during a boating trip. The circumstances surrounding her death remain unresolved, fueling speculation and fascination for decades."
  },
  {
    "id": 53,
    "name": "Tom Petty",
    "birth": "1950-10-20",
    "birth_place": "Gainesville, USA",
    "death": "2017-10-02",
    "death_place": "Santa Monica, USA",
    "cause_of_death": "Drug Overdose",
    "profile_pic": "https://upload.wikimedia.org/wikipedia/commons/5/5a/Tom_Petty_Live_in_Horsens_%28cropped2%29.jpg",
    "bio": "Tom Petty was a beloved American rock musician, singer, and songwriter, best known as the frontman of Tom Petty and the Heartbreakers. With timeless hits like 'Free Fallin',' 'American Girl,' and 'I Won't Back Down,' Petty's music became the soundtrack of generations. His distinct voice, heartfelt lyrics, and blend of rock and folk cemented his status as a legend. He passed away in 2017 due to an accidental drug overdose, caused by medications taken for severe hip pain."
  },
  {
    "id": 54,
    "name": "Keith Moon",
    "birth": "1946-08-23",
    "birth_place": "London, England",
    "death": "1978-09-07",
    "death_place": "London, England",
    "cause_of_death": "Drug Overdose",
    "profile_pic": "https://www.mercurynews.com/wp-content/uploads/2018/06/WGR-L-KEITHMOON-0615.jpg?w=1464",
    "bio": "Keith Moon was the electrifying and eccentric drummer of the British rock band The Who, known for his high-energy performances and unpredictable behavior both on and off stage. Moon's drumming style revolutionized rock music with its power and creativity, heard in hits like 'My Generation' and 'Baba O'Riley.' Despite his musical genius, Moon's destructive lifestyle caught up with him, and he died in 1978 from an overdose of prescription pills meant to treat his alcohol withdrawal."
  },
  {
    "id": 55,
    "name": "Naya Rivera",
    "birth": "1987-01-12",
    "birth_place": "Santa Clarita, USA",
    "death": "2020-07-08",
    "death_place": "Lake Piru, USA",
    "cause_of_death": "Drowning",
    "profile_pic": "https://i.guim.co.uk/img/media/ce99d9d35ebea0b35a7339fff30e4f92e60e0af4/1274_194_2993_1796/master/2993.jpg?width=1900&dpr=2&s=none&crop=none",
    "bio": "Naya Rivera was a talented American actress, singer, and model best remembered for her groundbreaking role as Santana Lopez on the hit TV series 'Glee.' Rivera's portrayal brought depth and representation to LGBTQ+ characters on mainstream television. Beyond acting, she had a successful music career and was admired for her advocacy and warmth. In 2020, Rivera tragically drowned at Lake Piru, California, while saving her young son, leaving behind a legacy of inspiration and talent."
  },
  {
    "id": 56,
    "name": "The Notorious B.I.G.",
    "birth": "1972-05-21",
    "birth_place": "Brooklyn, USA",
    "death": "1997-03-09",
    "death_place": "Los Angeles, USA",
    "cause_of_death": "Assassination",
    "profile_pic": "https://upload.wikimedia.org/wikipedia/en/8/8c/Biggie_Smalls_1997.jpg",
    "bio": "The Notorious B.I.G., born Christopher Wallace, was a legendary American rapper whose storytelling ability and lyrical flow revolutionized East Coast hip-hop. Known for hits like 'Juicy,' 'Big Poppa,' and 'Mo Money Mo Problems,' Biggie's rise to fame came quickly but was cut short when he was murdered in a drive-by shooting in 1997 at the age of 24. His influence on rap music remains profound, and he is widely regarded as one of the greatest rappers of all time."
  },
  {
    "id": 57,
    "name": "John Candy",
    "birth": "1950-10-31",
    "birth_place": "Newmarket, Canada",
    "death": "1994-03-04",
    "death_place": "Durango, Mexico",
    "cause_of_death": "Heart Attack, disease",
    "profile_pic": "https://resizing.flixster.com/S5q2lGpuPQucpO-mrJG3p-VCnOE=/218x280/v2/https://resizing.flixster.com/-XZAfHZM39UwaGJIFWKAE8fS0ak=/v3/t/assets/269_v9_ba.jpg",
    "bio": "John Candy was a beloved Canadian comedian and actor, renowned for his endearing and hilarious performances in films like 'Planes, Trains and Automobiles,' 'Uncle Buck,' and 'Cool Runnings.' Known for his larger-than-life personality, Candy had an unmatched ability to bring warmth and laughter to audiences. He tragically passed away from a heart attack in 1994 while filming in Mexico, leaving behind a legacy of comedic brilliance."
  },
  {
    "id": 58,
    "name": "Ritchie Valens",
    "birth": "1941-05-13",
    "birth_place": "Pacoima, USA",
    "death": "1959-02-03",
    "death_place": "Clear Lake, USA",
    "cause_of_death": "Accident",
    "profile_pic": "https://cdn.britannica.com/53/227453-050-A025A3ED/Ritchie-Valens.jpg",
    "bio": "Ritchie Valens was a pioneering rock and roll musician who achieved significant success at a very young age. Known for hits like 'La Bamba' and 'Donna,' Valens was one of the first Latino artists to break into mainstream rock music. His promising career was tragically cut short in 1959 when he died in a plane crash at the age of 17, a day remembered as 'The Day the Music Died.'"
  },
  {
    "id": 59,
    "name": "Grace Kelly",
    "birth": "1929-11-12",
    "birth_place": "Philadelphia, USA",
    "death": "1982-09-14",
    "death_place": "Monaco",
    "cause_of_death": "Accident",
    "profile_pic": "https://upload.wikimedia.org/wikipedia/commons/c/cb/Grace_Kelly30419.jpg",
    "bio": "Grace Kelly was an iconic American actress who became royalty as Princess of Monaco. She achieved international fame with her roles in classic films like 'Rear Window,' 'Dial M for Murder,' and 'To Catch a Thief.' After marrying Prince Rainier III, she retired from acting to fulfill her royal duties. Tragically, she died in a car accident in 1982, leaving behind a legacy of beauty, grace, and timeless elegance."
  },
  {
    "id": 60,
    "name": "Aretha Franklin",
    "birth": "1942-03-25",
    "birth_place": "Memphis, USA",
    "death": "2018-08-16",
    "death_place": "Detroit, USA",
    "cause_of_death": "Pancreatic Cancer, disease",
    "profile_pic": "https://hips.hearstapps.com/hmg-prod/images/gettyimages-74271305.jpg?resize=1200:*",
    "bio": "Aretha Franklin, known as the 'Queen of Soul,' was an American singer, songwriter, and pianist whose powerful voice and profound songs defined generations. With timeless hits like 'Respect,' 'Chain of Fools,' and 'Think,' Franklin became a symbol of empowerment and resilience. She also played an active role in the civil rights movement. She passed away in 2018 from pancreatic cancer, leaving a monumental legacy in music and culture."
  },
  {
    "id": 61,
    "name": "Albert Einstein",
    "birth": "1879-03-14",
    "birth_place": "Ulm, Germany",
    "death": "1955-04-18",
    "death_place": "Princeton, USA",
    "cause_of_death": "Abdominal Aortic Aneurysm, disease",
    "profile_pic": "https://preview.redd.it/eycjhyit0ty71.jpg?width=2346&format=pjpg&auto=webp&s=d2f47bd200c3ae6b29c7f8acffbde1d8dc0346ac",
    "bio": "Albert Einstein was a German-born theoretical physicist who developed the theory of relativity, revolutionizing the understanding of space, time, and energy. His famous equation, E=mc², became iconic. Einstein's discoveries earned him the Nobel Prize in Physics in 1921, and he advocated for peace and scientific progress. He spent his final years in Princeton, USA, where he passed away in 1955 from an abdominal aortic aneurysm."
  },
  {
    "id": 62,
    "name": "Steve Jobs",
    "birth": "1955-02-24",
    "birth_place": "San Francisco, USA",
    "death": "2011-10-05",
    "death_place": "Palo Alto, USA",
    "cause_of_death": "Pancreatic Cancer, disease",
    "profile_pic": "https://hips.hearstapps.com/hmg-prod/images/apple-ceo-steve-jobs-speaks-during-an-apple-special-event-news-photo-1683661736.jpg?crop=0.757xw:0.534xh;0.0799xw,0.0372xh&resize=1200:*",
    "bio": "Steve Jobs was a visionary entrepreneur, inventor, and co-founder of Apple Inc., who revolutionized technology with products like the iPhone, iPad, and Macintosh. Known for his unparalleled design sensibility and innovation, Jobs transformed the way people interact with technology. Despite battling pancreatic cancer, he continued to inspire through his leadership until his passing in 2011."
  },
  {
    "id": 63,
    "name": "Leonard Cohen",
    "birth": "1934-09-21",
    "birth_place": "Westmount, Canada",
    "death": "2016-11-07",
    "death_place": "Los Angeles, USA",
    "cause_of_death": "Natural Causes, disease",
    "profile_pic": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b4/Leonard_Cohen%2C_1988_01.jpg/1024px-Leonard_Cohen%2C_1988_01.jpg",
    "bio": "Leonard Cohen was a Canadian singer-songwriter, poet, and novelist whose works explored themes of love, faith, and longing. Known for his deep, gravelly voice, Cohen produced timeless songs like 'Hallelujah' and 'Suzanne,' blending folk, rock, and literary excellence. His contributions to art and music spanned decades, and he continued to create until his passing in 2016 at the age of 82."
  },
  {
    "id": 64,
    "name": "Stan Lee",
    "birth": "1922-12-28",
    "birth_place": "New York City, USA",
    "death": "2018-11-12",
    "death_place": "Los Angeles, USA",
    "cause_of_death": "Pneumonia, disease",
    "profile_pic": "https://upload.wikimedia.org/wikipedia/commons/7/7b/Stan_Lee_by_Gage_Skidmore_3.jpg",
    "bio": "Stan Lee was an American comic book writer, editor, and publisher who revolutionized the comic book industry. As the creative force behind Marvel Comics, he co-created iconic superheroes such as Spider-Man, the X-Men, Iron Man, Thor, and the Avengers. Lee's storytelling made superheroes more relatable and human, captivating generations of readers. His cameos in Marvel movies made him a beloved figure worldwide. Lee passed away at the age of 95 due to complications of pneumonia in 2018."
  },
  {
    "id": 65,
    "name": "John Denver",
    "birth": "1943-12-31",
    "birth_place": "Roswell, USA",
    "death": "1997-10-12",
    "death_place": "Monterey Bay, USA",
    "cause_of_death": "Accident",
    "profile_pic": "https://i.discogs.com/b6o6Odxban7ok1rZI6ufb3QAbfpXXSUg2pVn8FJwpv0/rs:fit/g:sm/q:90/h:500/w:500/czM6Ly9kaXNjb2dz/LWRhdGFiYXNlLWlt/YWdlcy9BLTI1MjM5/MS0xNTk4ODM4MTI0/LTI5MDAucG5n.jpeg",
    "bio": "John Denver was an American singer-songwriter, environmentalist, and humanitarian known for his heartfelt folk and country music. Songs like 'Take Me Home, Country Roads,' 'Annie's Song,' and 'Rocky Mountain High' made him a beloved figure across generations. Denver's music celebrated nature, love, and life. He tragically died in 1997 while piloting his experimental aircraft over Monterey Bay, California."
  },
  {
    "id": 66,
    "name": "Isaac Newton",
    "birth": "1643-01-04",
    "birth_place": "Woolsthorpe, England",
    "death": "1727-03-31",
    "death_place": "Kensington, England",
    "cause_of_death": "Natural Causes, disease",
    "profile_pic": "https://hips.hearstapps.com/hmg-prod/images/isaac_newton_1689_painting_sir_godfrey_kneller_public_domain_via_wikimedia_commons.jpg?resize=1200:*",
    "bio": "Sir Isaac Newton was an English mathematician, physicist, and astronomer whose work laid the foundations for classical mechanics. His groundbreaking discoveries, including the laws of motion and universal gravitation, transformed science forever. Newton's contributions to optics, mathematics (calculus), and physics remain unparalleled. He spent his final years as a revered scholar in London until his passing in 1727."
  },
  {
    "id": 67,
    "name": "Stephen Hawking",
    "birth": "1942-01-08",
    "birth_place": "Oxford, England",
    "death": "2018-03-14",
    "death_place": "Cambridge, England",
    "cause_of_death": "ALS, disease",
    "profile_pic": "https://futureoflife.org/wp-content/uploads/2023/06/Stephen_William_Hawking_at_Weston_Library_Opening_20.3.15_cropped_Hawking-e1688141337254.jpg",
    "bio": "Stephen Hawking was a theoretical physicist, cosmologist, and author whose groundbreaking work on black holes and the nature of the universe made him one of the most brilliant minds of our time. Diagnosed with ALS at a young age, he defied the odds and continued his research, writing books like 'A Brief History of Time,' which popularized science for the masses. Hawking passed away peacefully in 2018, leaving behind a monumental legacy in science and inspiration."
  },
  {
    "id": 68,
    "name": "Rosa Parks",
    "birth": "1913-02-04",
    "birth_place": "Tuskegee, USA",
    "death": "2005-10-24",
    "death_place": "Detroit, USA",
    "cause_of_death": "Natural Causes, disease",
    "profile_pic": "https://explore.rebelgirls.com/wp-content/uploads/2024/05/Rosa_Parks_2-796x1024.jpeg",
    "bio": "Rosa Parks was an American civil rights activist who became a symbol of resistance when she refused to give up her bus seat to a white passenger in 1955. Her courage sparked the Montgomery Bus Boycott, a pivotal moment in the civil rights movement. Parks dedicated her life to the fight for racial equality and justice, becoming known as 'the mother of the civil rights movement.' She passed away peacefully in 2005."
  },
  {
    "id": 69,
    "name": "Alex Trebek",
    "birth": "1940-07-22",
    "birth_place": "Sudbury, Canada",
    "death": "2020-11-08",
    "death_place": "Los Angeles, USA",
    "cause_of_death": "Pancreatic Cancer, disease",
    "profile_pic": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/45/Alex_Trebek_at_the_71st_Annual_Peabody_Awards_%28cropped%29.jpg/1280px-Alex_Trebek_at_the_71st_Annual_Peabody_Awards_%28cropped%29.jpg",
    "bio": "Alex Trebek was a beloved Canadian-American television personality best known as the host of the long-running game show 'Jeopardy!' for over three decades. Trebek's intelligence, charisma, and warmth endeared him to millions of viewers worldwide. Even as he battled pancreatic cancer, Trebek continued to host the show with grace and determination until his passing in 2020."
  },
  {
    "id": 70,
    "name": "Amelia Earhart",
    "birth": "1897-07-24",
    "birth_place": "Atchison, USA",
    "death": "1937-07-02",
    "death_place": "Pacific Ocean",
    "cause_of_death": "Disappearance",
    "profile_pic": "https://cdn.britannica.com/78/164578-050-634E4E33/Amelia-Earhart.jpg",
    "bio": "Amelia Earhart was an American aviation pioneer and the first female pilot to fly solo across the Atlantic Ocean. She broke numerous aviation records and inspired generations of women to pursue their dreams. In 1937, during her attempt to circumnavigate the globe, she disappeared over the Pacific Ocean, and her fate remains one of history's greatest unsolved mysteries. Earhart's courage and legacy live on in the annals of aviation history."
  },
  {
    "id": 71,
    "name": "Lisa 'Left Eye' Lopes",
    "birth": "1971-05-27",
    "birth_place": "Philadelphia, USA",
    "death": "2002-04-25",
    "death_place": "La Ceiba, Honduras",
    "cause_of_death": "Accident",
    "profile_pic": "https://hips.hearstapps.com/hmg-prod/images/gettyimages-135122752.jpg?resize=1200:*",
    "bio": "Lisa 'Left Eye' Lopes was a rapper, singer, and member of the influential R&B group TLC. Known for her distinctive voice, dynamic energy, and creative contributions to hits like 'Waterfalls' and 'No Scrubs,' she became a cultural icon of the 1990s. Lopes was also passionate about philanthropy and spirituality. Her life was tragically cut short in 2002 when she died in a car accident in Honduras."
  },
  {
    "id": 72,
    "name": "Eddie Guerrero",
    "birth": "1967-10-09",
    "birth_place": "El Paso, USA",
    "death": "2005-11-13",
    "death_place": "Minneapolis, USA",
    "cause_of_death": "Heart Failure, disease",
    "profile_pic": "https://nationaltoday.com/wp-content/uploads/2022/09/Eddie-Guerrero-Birthday.jpg",
    "bio": "Eddie Guerrero was a legendary professional wrestler who captivated audiences with his charisma, skill, and underdog spirit. As one of WWE's most beloved champions, Guerrero was known for his catchphrase 'Lie, Cheat, and Steal' and matches that showcased his technical prowess. Despite personal struggles, his legacy as a wrestling icon remains strong. Guerrero tragically died of heart failure in 2005 at the age of 38."
  },
  {
    "id": 73,
    "name": "Cameron Boyce",
    "birth": "1999-05-28",
    "birth_place": "Los Angeles, USA",
    "death": "2019-07-06",
    "death_place": "Los Angeles, USA",
    "cause_of_death": "Epileptic Seizure, disease",
    "profile_pic": "https://upload.wikimedia.org/wikipedia/commons/d/d7/Cameron_Boyce_in_october_2017.jpg",
    "bio": "Cameron Boyce was an American actor known for his roles in Disney Channel productions like 'Jessie' and the 'Descendants' film series. With his charm and talent, Boyce became a beloved figure among young audiences. He also dedicated himself to charitable work, striving to make a positive impact. Boyce passed away unexpectedly in 2019 due to complications from epilepsy, leaving a lasting legacy."
  },
  {
    "id": 74,
    "name": "Martin Luther King Jr.",
    "birth": "1929-01-15",
    "birth_place": "Atlanta, USA",
    "death": "1968-04-04",
    "death_place": "Memphis, USA",
    "cause_of_death": "Assassination",
    "profile_pic": "https://hips.hearstapps.com/hmg-prod/images/martin-luther-king-jr-9365086-2-402.jpg?resize=1200:*",
    "bio": "Martin Luther King Jr. was a Baptist minister and civil rights leader who became the face of the American civil rights movement. Known for his advocacy of nonviolent resistance and his 'I Have a Dream' speech, King inspired millions worldwide. His leadership led to significant legislative changes, including the Civil Rights Act. King was assassinated in Memphis in 1968, but his legacy as a symbol of justice and equality endures."
  },
  {
    "id": 75,
    "name": "Kobe Bryant",
    "birth": "1978-08-23",
    "birth_place": "Philadelphia, USA",
    "death": "2020-01-26",
    "death_place": "Calabasas, USA",
    "cause_of_death": "Accident",
    "profile_pic": "https://upload.wikimedia.org/wikipedia/commons/thumb/4/4e/Kobe_Bryant_7144_adjusted.jpg/1024px-Kobe_Bryant_7144_adjusted.jpg",
    "bio": "Kobe Bryant was an American professional basketball player widely regarded as one of the greatest athletes in NBA history. Spending his entire 20-year career with the Los Angeles Lakers, Bryant won five NBA championships and earned two Olympic gold medals. His relentless work ethic and 'Mamba Mentality' made him an inspiration worldwide. Bryant tragically died in a helicopter crash alongside his daughter Gianna in 2020."
  },
  {
    "id": 76,
    "name": "Marie Curie",
    "birth": "1867-11-07",
    "birth_place": "Warsaw, Poland",
    "death": "1934-07-04",
    "death_place": "Passy, France",
    "cause_of_death": "Aplastic Anemia, disease",
    "profile_pic": "https://i.pinimg.com/736x/2e/56/09/2e560966e5492d636f9cba6202bbf070.jpg",
    "bio": "Marie Curie was a Polish-born physicist and chemist renowned for her pioneering research on radioactivity. She was the first woman to win a Nobel Prize and remains the only person to win Nobel Prizes in two different sciences (Physics and Chemistry). Her discoveries of polonium and radium advanced medical and scientific fields. Curie died in 1934 from aplastic anemia caused by prolonged exposure to radiation."
  },
  {
    "id": 77,
    "name": "B.B. King",
    "birth": "1925-09-16",
    "birth_place": "Itta Bena, USA",
    "death": "2015-05-14",
    "death_place": "Las Vegas, USA",
    "cause_of_death": "Alzheimer's Disease, disease",
    "profile_pic": "https://www.blackpast.org/wp-content/uploads/bb-king.jpg",
    "bio": "B.B. King was an American blues guitarist and singer who earned the title 'King of the Blues.' Known for his expressive playing style and hits like 'The Thrill Is Gone,' King influenced countless musicians across genres. His guitar, 'Lucille,' became iconic in music history. He continued performing well into his 80s, passing away in 2015 from complications of Alzheimer's disease."
  },
  {
    "id": 78,
    "name": "Luciano Pavarotti",
    "birth": "1935-10-12",
    "birth_place": "Modena, Italy",
    "death": "2007-09-06",
    "death_place": "Modena, Italy",
    "cause_of_death": "Pancreatic Cancer, disease",
    "profile_pic": "https://m.media-amazon.com/images/M/MV5BMjEzNzk0MTM2OV5BMl5BanBnXkFtZTcwODYyMjUxOA@@._V1_.jpg",
    "bio": "Luciano Pavarotti was an Italian operatic tenor who became one of the most celebrated and commercially successful opera singers in history. Known for his powerful and emotive voice, Pavarotti brought opera to a broader audience with performances like 'Nessun Dorma.' His charity work and crossover appeal cemented his legacy as a musical icon. He passed away in 2007 due to pancreatic cancer."
  },
  {
    "id": 79,
    "name": "Nikola Tesla",
    "birth": "1856-07-10",
    "birth_place": "Smiljan, Croatia",
    "death": "1943-01-07",
    "death_place": "New York City, USA",
    "cause_of_death": "Coronary Thrombosis, disease",
    "profile_pic": "https://zemgroup.com/en/wp-content/uploads/2024/04/tesla-1.jpg",
    "bio": "Nikola Tesla was a Serbian-American inventor, electrical engineer, and futurist best known for his groundbreaking work in electricity and magnetism. He developed the alternating current (AC) system, which powers modern civilization. Despite financial struggles, Tesla's contributions to wireless communication and electrical engineering continue to shape technology today. He died alone in 1943, leaving an unparalleled scientific legacy."
  },
  {
    "id": 80,
    "name": "Frida Kahlo",
    "birth": "1907-07-06",
    "birth_place": "Coyoacán, Mexico",
    "death": "1954-07-13",
    "death_place": "Coyoacán, Mexico",
    "cause_of_death": "Pulmonary Embolism, disease",
    "profile_pic": "https://www.artleove.com/wp-content/uploads/2021/05/image1.jpg",
    "bio": "Frida Kahlo was a Mexican painter whose deeply personal and surrealist works explored themes of identity, pain, and culture. Known for her self-portraits, Kahlo captured her struggles with physical illness and emotional suffering. She became a feminist icon and a symbol of resilience. Kahlo's influence extended beyond art, representing Mexican heritage and women's empowerment. She passed away in 1954 at the age of 47."
  },
  {
    "id": 81,
    "name": "Anne Frank",
    "birth": "1929-06-12",
    "birth_place": "Frankfurt, Germany",
    "death": "1945-02-01",
    "death_place": "Bergen-Belsen, Germany",
    "cause_of_death": "Typhus, disease",
    "profile_pic": "https://i.redd.it/ospqedbiq47c1.jpeg",
    "bio": "Anne Frank was a Jewish diarist who documented her life in hiding during the Nazi occupation of the Netherlands. Her posthumously published diary, 'The Diary of a Young Girl,' provides a powerful and poignant perspective on the Holocaust. Frank's words continue to inspire readers worldwide as a testament to hope, humanity, and resilience. She died in 1945 at the Bergen-Belsen concentration camp."
  },
  {
    "id": 82,
    "name": "Mark Twain",
    "birth": "1835-11-30",
    "birth_place": "Florida, USA",
    "death": "1910-04-21",
    "death_place": "Redding, USA",
    "cause_of_death": "Heart Attack, disease",
    "profile_pic": "https://ebbg7broonn.exactdn.com/wp-content/uploads/2019/04/Mark-Twain-Portrait.jpg?strip=all&lossy=1&ssl=1",
    "bio": "Mark Twain, born Samuel Langhorne Clemens, was an American writer and humorist known for his sharp wit and critical commentary on society. His novels, including 'The Adventures of Tom Sawyer' and 'Adventures of Huckleberry Finn,' remain classics of American literature. Twain's storytelling and humor made him a beloved figure in literary history. He passed away in 1910 at the age of 74."
  },
  {
    "id": 83,
    "name": "Phil Hartman",
    "birth": "1948-09-24",
    "birth_place": "Brantford, Canada",
    "death": "1998-05-28",
    "death_place": "Encino, USA",
    "cause_of_death": "Assassination",
    "profile_pic": "https://upload.wikimedia.org/wikipedia/commons/4/44/Phil_as_Chick-1-1.jpg",
    "bio": "Phil Hartman was a Canadian-American comedian and actor best known for his work on 'Saturday Night Live' and 'The Simpsons.' Hartman's comedic timing and versatile characters made him a beloved figure in comedy. His life was tragically cut short in 1998 when he was killed in a domestic incident, leaving behind a legacy of laughter and brilliant performances."
  },
  {
    "id": 84,
    "name": "Etta James",
    "birth": "1938-01-25",
    "birth_place": "Los Angeles, USA",
    "death": "2012-01-20",
    "death_place": "Riverside, USA",
    "cause_of_death": "Leukemia, disease",
    "profile_pic": "https://cdn.britannica.com/59/23159-050-52EDAD9A/Etta-James.jpg",
    "bio": "Etta James was a legendary American singer whose powerful voice spanned blues, R&B, soul, and gospel. Known for classics like 'At Last' and 'Tell Mama,' James overcame personal struggles to achieve enduring success. Her music influenced countless artists, and she received numerous accolades, including Grammy Awards. She passed away in 2012 after a long battle with leukemia."
  },
  {
    "id": 85,
    "name": "Muhammad Ali",
    "birth": "1942-01-17",
    "birth_place": "Louisville, USA",
    "death": "2016-06-03",
    "death_place": "Scottsdale, USA",
    "cause_of_death": "Parkinson's Disease, disease",
    "profile_pic": "https://cdn.britannica.com/86/192386-050-D7F3126D/Muhammad-Ali-American.jpg",
    "bio": "Muhammad Ali, born Cassius Clay, was an American professional boxer widely regarded as 'The Greatest.' Known for his unparalleled athleticism, charisma, and activism, Ali's victories, including his legendary fights against Sonny Liston and Joe Frazier, made him a global icon. He used his fame to speak out against racial injustice and war. Ali passed away in 2016 after a long battle with Parkinson's disease."
  },
  {
    "id": 86,
    "name": "Ray Charles",
    "birth": "1930-09-23",
    "birth_place": "Albany, USA",
    "death": "2004-06-10",
    "death_place": "Beverly Hills, USA",
    "cause_of_death": "Liver Disease, disease",
    "profile_pic": "https://cdn.britannica.com/69/82669-050-B3421191/Ray-Charles-Nashville-Tenn-2003.jpg",
    "bio": "Ray Charles was an American musician and pioneer of soul music. Despite losing his sight at a young age, Charles developed a revolutionary sound by blending R&B, gospel, and country. Hits like 'Georgia on My Mind' and 'Hit the Road Jack' earned him international acclaim. Charles influenced generations of musicians before passing away in 2004 from complications related to liver disease."
  },
  {
    "id": 87,
    "name": "George Harrison",
    "birth": "1943-02-25",
    "birth_place": "Liverpool, England",
    "death": "2001-11-29",
    "death_place": "Los Angeles, USA",
    "cause_of_death": "Lung Cancer, disease",
    "profile_pic": "https://images.saymedia-content.com/.image/c_limit%2Ccs_srgb%2Cq_auto:eco%2Cw_295/MTc0MTkyOTk3MzI2Mzk4OTcy/george-harrison-the-spiritual-beatle.webp",
    "bio": "George Harrison was an English musician, singer, and songwriter, best known as the lead guitarist of The Beatles. Often referred to as the 'quiet Beatle,' Harrison brought elements of Indian classical music and spiritual themes into the band's work. His solo career flourished with hits like 'My Sweet Lord.' Harrison's contributions to music and his philanthropy have left a lasting legacy. He passed away in 2001 after battling lung cancer."
  },
  {
    "id": 88,
    "name": "Ernest Hemingway",
    "birth": "1899-07-21",
    "birth_place": "Oak Park, USA",
    "death": "1961-07-02",
    "death_place": "Ketchum, USA",
    "cause_of_death": "Suicide",
    "profile_pic": "https://es.babelio.com/users/AVT_Ernest-Hemingway_1659.jpg",
    "bio": "Ernest Hemingway was an American novelist, journalist, and short-story writer renowned for his terse, understated style. A key figure of 20th-century literature, Hemingway penned classics like 'The Old Man and the Sea' and 'A Farewell to Arms.' A war correspondent and adventurer, Hemingway's life was as dramatic as his fiction. He died by suicide in 1961 after battling physical and mental health issues."
  },
  {
    "id": 89,
    "name": "Florence Nightingale",
    "birth": "1820-05-12",
    "birth_place": "Florence, Italy",
    "death": "1910-08-13",
    "death_place": "London, England",
    "cause_of_death": "Heart Failure, disease",
    "profile_pic": "https://www.photorestoration.services/app/uploads/2020/05/Florence-Nightingale-Colourised-credit-1024x716.jpg",
    "bio": "Florence Nightingale, known as 'The Lady with the Lamp,' revolutionized healthcare as the founder of modern nursing. Her work during the Crimean War transformed sanitation practices and hospital care. Nightingale's pioneering use of statistics to improve medical conditions laid the foundation for public health reforms. Her contributions remain an inspiration in healthcare worldwide."
  },
  {
    "id": 90,
    "name": "Helen Keller",
    "birth": "1880-06-27",
    "birth_place": "Tuscumbia, USA",
    "death": "1968-06-01",
    "death_place": "Easton, USA",
    "cause_of_death": "Natural Causes, disease",
    "profile_pic": "https://bpldcassets.blob.core.windows.net/derivatives/images/commonwealth:q237j268z/image_access_800.jpg",
    "bio": "Helen Keller was an American author, educator, and activist who overcame being both blind and deaf. With the help of her teacher Anne Sullivan, Keller became a symbol of perseverance, learning to communicate and earning a college degree. She authored several books, including 'The Story of My Life,' and dedicated her life to advocating for the disabled, becoming a global icon of resilience and hope."
  },
  {
    "id": 91,
    "name": "Agatha Christie",
    "birth": "1890-09-15",
    "birth_place": "Torquay, England",
    "death": "1976-01-12",
    "death_place": "Wallingford, England",
    "cause_of_death": "Natural Causes, disease",
    "profile_pic": "https://leavesandpages.com/wp-content/uploads/2013/07/agatha_christie_1.jpg",
    "bio": "Agatha Christie, the 'Queen of Crime,' was a prolific English author best known for her detective novels and short stories. She created iconic characters like Hercule Poirot and Miss Marple, and her works, including 'Murder on the Orient Express' and 'The Mousetrap,' have sold billions of copies worldwide. Christie's ability to craft ingenious mysteries solidified her as a literary legend."
  },
  {
    "id": 92,
    "name": "George Carlin",
    "birth": "1937-05-12",
    "birth_place": "New York City, USA",
    "death": "2008-06-22",
    "death_place": "Santa Monica, USA",
    "cause_of_death": "Heart Failure, disease",
    "profile_pic": "https://cdn.britannica.com/23/149023-050-67AE9239/George-Carlin.jpg",
    "bio": "George Carlin was an American stand-up comedian, writer, and social critic known for his sharp wit and commentary on contemporary issues. Famous for his 'Seven Words You Can Never Say on Television,' Carlin pushed boundaries and shaped modern comedy. His fearless approach to taboo topics earned him a reputation as one of the greatest comedians of all time."
  },
  {
    "id": 93,
    "name": "Bob Ross",
    "birth": "1942-10-29",
    "birth_place": "Daytona Beach, USA",
    "death": "1995-07-04",
    "death_place": "Orlando, USA",
    "cause_of_death": "Lymphoma, disease",
    "profile_pic": "https://upload.wikimedia.org/wikipedia/en/7/70/Bob_at_Easel.jpg",
    "bio": "Bob Ross was an American painter and art instructor, best known for his television show 'The Joy of Painting.' With his calming demeanor and signature phrases like 'happy little trees,' Ross made art accessible and joyful for millions. Though he passed away in 1995, his legacy continues to inspire creativity and mindfulness through his work."
  },
  {
    "id": 94,
    "name": "Pablo Picasso",
    "birth": "1881-10-25",
    "birth_place": "Málaga, Spain",
    "death": "1973-04-08",
    "death_place": "Mougins, France",
    "cause_of_death": "Heart Failure, disease",
    "profile_pic": "https://lisbonpriderock.wordpress.com/wp-content/uploads/2016/12/mte1oda0otcxnzu0mdk2mtqx.jpg",
    "bio": "Pablo Picasso was a Spanish painter, sculptor, and co-founder of the Cubist movement. A prolific artist, Picasso produced thousands of works across multiple mediums, including his iconic 'Guernica' and 'Les Demoiselles d'Avignon.' His revolutionary approach to art influenced generations of artists and redefined 20th-century visual culture."
  },
  {
    "id": 95,
    "name": "Chris Farley",
    "birth": "1964-02-15",
    "birth_place": "Madison, USA",
    "death": "1997-12-18",
    "death_place": "Chicago, USA",
    "cause_of_death": "Drug Overdose",
    "profile_pic": "https://cdn.britannica.com/74/242774-050-9F1A8F0D/Chris-Farley.jpg",
    "bio": "Chris Farley was a beloved American comedian and actor best known for his over-the-top energy and physical comedy on 'Saturday Night Live.' Farley's roles in films like 'Tommy Boy' and 'Black Sheep' showcased his comedic brilliance and lovable personality. His struggles with addiction cut his life short in 1997, but his comedic legacy remains timeless."
  },
  {
    "id": 96,
    "name": "Maya Angelou",
    "birth": "1928-04-04",
    "birth_place": "St. Louis, USA",
    "death": "2014-05-28",
    "death_place": "Winston-Salem, USA",
    "cause_of_death": "Natural Causes, disease",
    "profile_pic": "https://hips.hearstapps.com/hmg-prod/images/maya_angelou_photo_by_deborah_feingold_corbis_entertainment_getty_533084708.jpg?crop=1.00xw:1.00xh;0,0&resize=1200:*",
    "bio": "Maya Angelou was an American poet, memoirist, and civil rights activist renowned for her autobiographical series, starting with 'I Know Why the Caged Bird Sings.' Angelou’s work explored themes of identity, race, and resilience, making her an influential voice for justice and equality. She also performed as a dancer, singer, and actor, leaving a profound impact on American culture."
  },
  {
    "id": 97,
    "name": "Alan Turing",
    "birth": "1912-06-23",
    "birth_place": "London, England",
    "death": "1954-06-07",
    "death_place": "Wilmslow, England",
    "cause_of_death": "Suicide",
    "profile_pic": "https://preview.redd.it/51dcpxhdwcox.jpg?width=640&crop=smart&auto=webp&s=c9cd2a728bad539bce6fa2c17f4589ac763b4216",
    "bio": "Alan Turing was an English mathematician, computer scientist, and cryptanalyst who played a critical role in breaking the Enigma code during World War II. Often regarded as the father of computer science, Turing's theoretical work laid the foundation for modern computing. Despite his contributions, he faced persecution due to his homosexuality, leading to his tragic death by suicide in 1954. Today, Turing's legacy is celebrated for revolutionizing technology and advancing mathematics."
  },
  {
    "id": 98,
    "name": "Nelson Mandela",
    "birth": "1918-07-18",
    "birth_place": "Mvezo, South Africa",
    "death": "2013-12-05",
    "death_place": "Johannesburg, South Africa",
    "cause_of_death": "Respiratory Infection, disease",
    "profile_pic": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/02/Nelson_Mandela_1994.jpg/640px-Nelson_Mandela_1994.jpg",
    "bio": "Nelson Mandela was a South African anti-apartheid revolutionary, political leader, and philanthropist. He served as the first democratically elected President of South Africa and dedicated his life to ending apartheid and promoting equality. Mandela's imprisonment for 27 years became a global symbol of resilience and justice. His leadership earned him the Nobel Peace Prize in 1993, and his legacy continues to inspire people worldwide."
  },
  {
    "id": 99,
    "name": "Leonardo da Vinci",
    "birth": "1452-04-15",
    "birth_place": "Vinci, Italy",
    "death": "1519-05-02",
    "death_place": "Amboise, France",
    "cause_of_death": "Stroke, disease",
    "profile_pic": "https://i.natgeofe.com/n/37c3c776-b8cb-4be1-988a-cf593c776b88/01-leonardo-da-vinci-book-talk_3x4.jpg",
    "bio": "Leonardo da Vinci was an Italian polymath of the Renaissance era, known for his groundbreaking contributions to art, science, and engineering. His masterpieces, such as the 'Mona Lisa' and 'The Last Supper,' are celebrated worldwide. Beyond art, da Vinci’s scientific notebooks revealed his genius in anatomy, mechanics, and innovation. His insatiable curiosity and boundless creativity made him one of the greatest minds in human history."
  },
  {
    "id": 100,
    "name": "Bob Marley",
    "birth": "1945-02-06",
    "birth_place": "Nine Mile, Jamaica",
    "death": "1981-05-11",
    "death_place": "Miami, USA",
    "cause_of_death": "Cancer, disease",
    "profile_pic": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcTfi11u1j1jwTwi-7aKookQSpPIpS8IEND17Q&s",
    "bio": "Bob Marley was a Jamaican singer, songwriter, and cultural icon who popularized reggae music globally. His powerful lyrics, infused with messages of unity, love, and resistance, made songs like 'One Love' and 'Redemption Song' timeless anthems. Marley's Rastafarian beliefs and activism inspired millions around the world. He died of cancer in 1981 at the age of 36, but his music and legacy continue to resonate worldwide."
  }
]